[
  {
    "BestLifeQuotes" :
[
{"quote":"'I need to talk to you' is the one sentence that has the power to make you remember every bad thing you've ever done in your life","name":"Best Life Quotes"},{"quote":",Be crazy, stupid, weird, strange, whatever. Life is too short to be anything but happy.","name":"Best Life Quotes"},{"quote":"3 Main rules in Relationships: Don`t lie, Don`t cheat, and Don`t make promises you can`t keep.","name":"Best Life Quotes"},{"quote":"3 steps to move on. CTRL + ALT + DEL. Control yourself, look for an alternate solution & delete the situation that hurts you.","name":"Best Life Quotes"},{"quote":"A goal properly set is halfway reached.","name":"Best Life Quotes"},{"quote":"A hundred hearts would be too few To carry all my love for you.","name":"Best Life Quotes"},{"quote":"A hundred hearts would be too few to carry all my love for you.","name":"Best Life Quotes"},{"quote":"A life without challenge would be like going to school without lessons to learn.","name":"Best Life Quotes"},{"quote":"A life without challenge would be like going to school without lessons to learn. Challenges come not to depress or get you down, but to master and to grow and to unfold your abilities.","name":"Best Life Quotes"},{"quote":"A million feelings, a thousand thoughts, a hundred memories, all for one person.","name":"Best Life Quotes"},{"quote":"A negotiator should observe everything. You must be part Sherlock Holmes, part Sigmund Freud.","name":"Best Life Quotes"},{"quote":"A penny saved is a penny earned.","name":"Best Life Quotes"},{"quote":"A person who asks a question is a FOOL for five minutes, A person who doesn’t is a FOOL forever.","name":"Best Life Quotes"},{"quote":"A place for everything, everything in its place.","name":"Best Life Quotes"},{"quote":"A question you never ask will never be answered","name":"Best Life Quotes"},{"quote":"A real woman isn't perfect. A perfect woman isn't real. All that matters is that her spirit and heart are real. If you can't handle that, then maybe you're not being real where it counts","name":"Best Life Quotes"},{"quote":"A smile is a curve that sets everything straight.","name":"Best Life Quotes"},{"quote":"A soul without conscience is like food without taste, it will sustain the body with life but with no fulfillment!","name":"Best Life Quotes"},{"quote":"A true friend is someone who is there for you when he'd rather be anywhere else.","name":"Best Life Quotes"},{"quote":"A true man doesn't promise, he commits...A true woman doesn't demand, she thanks","name":"Best Life Quotes"},{"quote":"A truly blind person is not one who cannot see but one who chooses not to.","name":"Best Life Quotes"},{"quote":"A wise man proportions his belief to the evidence.","name":"Best Life Quotes"},{"quote":"Absence sharpens love, but presence strengthens it.","name":"Best Life Quotes"},{"quote":"Accept that some days you're the pigeon, and some days you're the statue.","name":"Best Life Quotes"},{"quote":"Accept what you cant change, and change what you cant accept.","name":"Best Life Quotes"},{"quote":"Admit it, sometimes, even when your crush does something really weird, it still looks cute for you.","name":"Best Life Quotes"},{"quote":"Admit it, we all have someone's number in our phone that the other person doesn't know we have it. ;D","name":"Best Life Quotes"},{"quote":"Age is just a damn number, it doesn't stop you from loving someone","name":"Best Life Quotes"},{"quote":"All I want and all I need is only YOU!","name":"Best Life Quotes"},{"quote":"All human beings have three lives: public, private, and secret.","name":"Best Life Quotes"},{"quote":"All our words from loose using have lost their edge.","name":"Best Life Quotes"},{"quote":"All those who are still in school, this is for you – You are having the best time of your life, live it.","name":"Best Life Quotes"},{"quote":"Although fate presents the circumstances, how you react depends on your character","name":"Best Life Quotes"},{"quote":"Always be happy, always wear a smile, not b’coz life is full of reasons to smile but b’coz your smile itself is a reason for many others to smile.","name":"Best Life Quotes"},{"quote":"Always remember that in LIFE, whatever we do, we are never defeated unless we give-up","name":"Best Life Quotes"},{"quote":"Always remember that the most beautiful curve on your body is your smile :)","name":"Best Life Quotes"},{"quote":"Always remember to smile. You may not know it, but someone might be dying to see that smile everyday.","name":"Best Life Quotes"},{"quote":"Always remember: To the world, you may be just one Person, But to one Person, You may just be the WORLD.","name":"Best Life Quotes"},{"quote":"Always say goodbye with a smile for those you love. It may be the last time you’ll ever see them.","name":"Best Life Quotes"},{"quote":"An egg today is better than a hen to-morrow.","name":"Best Life Quotes"},{"quote":"An investment in knowledge pays the best interest.","name":"Best Life Quotes"},{"quote":"And at the end of the day, you either focus on what separated you, or what held you together","name":"Best Life Quotes"},{"quote":"And i'll never hesitate to keep on walking, because after every storm will always come the sun.","name":"Best Life Quotes"},{"quote":"And in the end, it's not the years in your life that count. It's the life in your years.","name":"Best Life Quotes"},{"quote":"Anger can be an effective negotiating tool, but only as a calculated act, never as a reaction.","name":"Best Life Quotes"},{"quote":"Anyone who lives within their means suffers from a lack of imagination.","name":"Best Life Quotes"},{"quote":"Anything in life that leaves butterflies in your stomach is worth experiencing","name":"Best Life Quotes"},{"quote":"Anything worth the tears is worth fighting for","name":"Best Life Quotes"},{"quote":"Appreciate your parents. You never know what sacrifices they went through for you.","name":"Best Life Quotes"},{"quote":"As a kid, you can't wait to grow up. As an adult, you wish you were a kid again","name":"Best Life Quotes"},{"quote":"As a kid, you can't wait to grow up. As an adult, you wish you were a kid again.","name":"Best Life Quotes"},{"quote":"As a kid, you can’t wait to grow up. As an adult, you wish you were a kid again.","name":"Best Life Quotes"},{"quote":"As long as you are breathing you still have the chance for a better and happier life.","name":"Best Life Quotes"},{"quote":"As long as you think the problem is out there, that very thought is the problem. ?","name":"Best Life Quotes"},{"quote":"As we grow older, we don't lose friends. We just learn who the real ones are.","name":"Best Life Quotes"},{"quote":"As you start and end your day, say ~thank you~ for every little things in your life. And you will come to realize how blessed you truly are.","name":"Best Life Quotes"},{"quote":"At one point in your life you either have the thing you want or the reasons why you don't","name":"Best Life Quotes"},{"quote":"At the end of the day before you close your eyes, be content with were you've been, and proud of who you are!","name":"Best Life Quotes"},{"quote":"Awsome moment when you listen to old songs and they remind you of the good old days.","name":"Best Life Quotes"},{"quote":"B+ … Not my blood group neither my grade in maths … Its my favourite quote. “BE POSITIVE”","name":"Best Life Quotes"},{"quote":"BEAUTY gets ATTENTION, but PERSONALITY captures the HEART.","name":"Best Life Quotes"},{"quote":"Be at war with your vices, at peace with your neighbours, and let every new year find you a better man.","name":"Best Life Quotes"},{"quote":"Be careful not to compromise what you want most for what you want now.","name":"Best Life Quotes"},{"quote":"Be careful of those who pat you on the back. They might be looking for a soft spot to plant the knife.","name":"Best Life Quotes"},{"quote":"Be careful who you trust and tell your problems to. Everyone who smiles at you is not your friend.","name":"Best Life Quotes"},{"quote":"Be confident. You will never get anywhere if you don’t believe in yourself.","name":"Best Life Quotes"},{"quote":"Be interesting, be enthusiastic, and don't talk too much.","name":"Best Life Quotes"},{"quote":"Be like a soldier, knows when to fight, knows when to surrender..","name":"Best Life Quotes"},{"quote":"Be like a tree; people throw stones at it but it throws down fruits at them.","name":"Best Life Quotes"},{"quote":"Be more concerned with your character than your reputation because you character is who you truly are but you reputation is merely what others think of you.","name":"Best Life Quotes"},{"quote":"Be nice to nerds. Chances are you'll end up working for one.","name":"Best Life Quotes"},{"quote":"Be nice to people on your way up b’coz you will meet them on your way down.","name":"Best Life Quotes"},{"quote":"Be nice to people on your way up, because you'll meet them on your way down.","name":"Best Life Quotes"},{"quote":"Be thankful for what you have. You have no idea how many people would love to have what you got.","name":"Best Life Quotes"},{"quote":"Be who you are and say what you feel because those who mind don't matter and those who matter don't mind","name":"Best Life Quotes"},{"quote":"Be who you are and say what you feel because those who mind don't matter and those who matter don't mind.","name":"Best Life Quotes"},{"quote":"Be wise in the decisions you make! sometimes it only takes a minute to make a decision, but you may end up spending a lifetimes regretting it.","name":"Best Life Quotes"},{"quote":"Be with someone who knows exactly what they have when they have you, not someone who will realize it when they've lost you.","name":"Best Life Quotes"},{"quote":"Beautiful pictures are developed from negatives in a dark room...So if you see darkness in your life be reassured that a beautiful picture is being prepared.","name":"Best Life Quotes"},{"quote":"Beauty and folly are old companions.","name":"Best Life Quotes"},{"quote":"Beauty doesn’t last forever but a beautiful personality does.","name":"Best Life Quotes"},{"quote":"Beauty isn`t measured by the number of likes of your picture on Facebook..","name":"Best Life Quotes"},{"quote":"Because of you, I can fight against the world just to be with you","name":"Best Life Quotes"},{"quote":"Because when you stop and look around, this life is pretty amazing","name":"Best Life Quotes"},{"quote":"Becoming number one is easier then remaining number one.","name":"Best Life Quotes"},{"quote":"Before I criticize someone, I walk a mile in their shoes. That way, if they get angry, they are a mile away and barefoot.","name":"Best Life Quotes"},{"quote":"Before you assume, learn. Before you hurt, feel. Before you judge, understand. Before you say, THINK.","name":"Best Life Quotes"},{"quote":"Begin doing what you want to do now. We are not living in eternity. We have only this moment, sparkling like a star in our hand-and melting like a snowflake","name":"Best Life Quotes"},{"quote":"Beginnings are usually scary and endings are usually sad, but it's everything in between that makes it all worth living","name":"Best Life Quotes"},{"quote":"Behind every beautiful thing, there is some kind of pain","name":"Best Life Quotes"},{"quote":"Behind every beautiful thing, there is some kind of pain.","name":"Best Life Quotes"},{"quote":"Being alone is better than being with the wrong person.","name":"Best Life Quotes"},{"quote":"Being defeated is often temporary, giving up makes it permanent.","name":"Best Life Quotes"},{"quote":"Being hurt doesn't give you the right to hurt anyone.","name":"Best Life Quotes"},{"quote":"Being left alone, with my mind, is actually quite dangerous","name":"Best Life Quotes"},{"quote":"Being on top of the world doesn't mean anything unless you know what it's like to be at the bottom.","name":"Best Life Quotes"},{"quote":"Being quiet doesn't always mean you don't have something to say","name":"Best Life Quotes"},{"quote":"Being single is not a big deal b’coz sooner or later you will find your true love.","name":"Best Life Quotes"},{"quote":"Believe deep down in your heart that you are destined to do great things.","name":"Best Life Quotes"},{"quote":"Best Advice: Silence is the best answer for all questions and smiling is the best reaction in all situations.","name":"Best Life Quotes"},{"quote":"Best Relationship: Talk like best friends, play like children, argue like husband & wife, protect each other like brother and sister.","name":"Best Life Quotes"},{"quote":"Best conversations always happen late in the night. :)","name":"Best Life Quotes"},{"quote":"Beware the hobby that eats.","name":"Best Life Quotes"},{"quote":"Biggest mistake ever is thinking with your heart and feeling with your mind. Things aren’t supposed to work this way.","name":"Best Life Quotes"},{"quote":"Boundaries help us know who we are, as well as who we are not","name":"Best Life Quotes"},{"quote":"Broken people are dangerous because they know they can survive","name":"Best Life Quotes"},{"quote":"By failing to prepare, you are preparing to fail.","name":"Best Life Quotes"},{"quote":"By the way, I’m wearing the smile you gave me.","name":"Best Life Quotes"},{"quote":"Can I have my heart back now please.","name":"Best Life Quotes"},{"quote":"Can you catch? I think I’m falling for you.","name":"Best Life Quotes"},{"quote":"Challenges are what make life interesting and overcoming them is what makes life meaningful.","name":"Best Life Quotes"},{"quote":"Challenges are what makes life interesting, overcoming them is what makes life meaningful.","name":"Best Life Quotes"},{"quote":"Challenges come not to depress or get you down, but to master and to grow and to unfold your abilities.","name":"Best Life Quotes"},{"quote":"Change will always come, not because it has to, not because it wants to, but because it’s necessary.","name":"Best Life Quotes"},{"quote":"Character is what you are. Reputation is what people think you are.","name":"Best Life Quotes"},{"quote":"Chase your dreams until you catch them .. and then dream, catch, and dream again..!","name":"Best Life Quotes"},{"quote":"Cheating is a choice… Not a mistake. Don’t be fooled.","name":"Best Life Quotes"},{"quote":"Coins always make sound but currency notes are always silent. So when your value increase keep yourself calm and silent.","name":"Best Life Quotes"},{"quote":"Courage is not having the strength to go on, its going on when you don't have the strength.","name":"Best Life Quotes"},{"quote":"Creditors have better memories than debtors.","name":"Best Life Quotes"},{"quote":"Cuddling in bed and falling asleep is probaby the best feeling in a relationship.","name":"Best Life Quotes"},{"quote":"DON'T make decisions when you're angry and Don't make promises when you're happy","name":"Best Life Quotes"},{"quote":"Dear teacher, I talk no matter where I am. Moving my seat will not help","name":"Best Life Quotes"},{"quote":"Dear teacher, I talk no matter where I am. Moving my seat will not help.","name":"Best Life Quotes"},{"quote":"Death is not the most tragic loss in life. The most tragic loss is what dies inside while your still alive","name":"Best Life Quotes"},{"quote":"Decisions are the hardest moves to make, especially when it’s a choice between what you want and what is right.","name":"Best Life Quotes"},{"quote":"Democratic and responsible trade unionism is the most powerful force for democracy and social justice around the world.","name":"Best Life Quotes"},{"quote":"Design is not just what it looks like and feels like. Design is how it works.","name":"Best Life Quotes"},{"quote":"Destiny is not a matter of chance. Its a matter of choice.","name":"Best Life Quotes"},{"quote":"Diplomacy is the art of letting someone else have your way.","name":"Best Life Quotes"},{"quote":"Distance means so little when someone means so much.","name":"Best Life Quotes"},{"quote":"Divide and Conquer.","name":"Best Life Quotes"},{"quote":"Do I turn left where nothing is right? Or do I turn right where nothing is left?","name":"Best Life Quotes"},{"quote":"Do I turn left, when nothing is right? Or do I turn right, when there's nothing left?","name":"Best Life Quotes"},{"quote":"Do I turn left, when nothing is right? Or do I turn right, when there’s nothing left?","name":"Best Life Quotes"},{"quote":"Do not fear mistakes. You will know failure. Continue to reach out.","name":"Best Life Quotes"},{"quote":"Do not go where a path may lead. Instead go where there is no path and leave a trail.","name":"Best Life Quotes"},{"quote":"Do not go where the path may lead, go instead where there is no path and leave a trail.","name":"Best Life Quotes"},{"quote":"Do not lose hold of your dreams or aspirations. For if you do, you may still exist but you have ceased to live.","name":"Best Life Quotes"},{"quote":"Do not think about the past. Accept the present. Think for the future & face tomorrow with a sweet and beautiful smile.","name":"Best Life Quotes"},{"quote":"Do you want to know who you are? Don't ask. Act! Action will delineate and define you.","name":"Best Life Quotes"},{"quote":"Does anybody know how can I send an enemy request on Facebook?","name":"Best Life Quotes"},{"quote":"Don t worry about what people think, they don t do it very often","name":"Best Life Quotes"},{"quote":"Don t worry about what people think, they don t do it very often.","name":"Best Life Quotes"},{"quote":"Don't allow your wounds to turn you into a person you are not.","name":"Best Life Quotes"},{"quote":"Don't be afraid of showing your feelings, be afraid of regretting it when you don't","name":"Best Life Quotes"},{"quote":"Don't be angry at those that disappoint you; after all, it was YOUR expectation they didn't live up to.","name":"Best Life Quotes"},{"quote":"Don't be sad if a person prefers another person over you. Because You can't convince a monkey that honey is sweeter than a banana...!;)","name":"Best Life Quotes"},{"quote":"Don't be so completely oblivious to the world that you can't see what's standing right in front of you. For all you know, it may be a good thing for once.","name":"Best Life Quotes"},{"quote":"Don't borrow someone else's plan. Develop your own philosophy and it will lead you to unique places. ?","name":"Best Life Quotes"},{"quote":"Don't chase people. Be you, do your own thing and work hard. The right people who belong in your life will come to you, and stay.","name":"Best Life Quotes"},{"quote":"Don't choose the one who is beautiful to the world. But rather, choose the one who makes your world beautiful","name":"Best Life Quotes"},{"quote":"Don't compare your life to others'. You have no idea what their journey is all about.!!","name":"Best Life Quotes"},{"quote":"Don't cry because it's over, smile because it happened","name":"Best Life Quotes"},{"quote":"Don't depend too much on anyone in this world because even your own shadow leaves you when you are in darkness.","name":"Best Life Quotes"},{"quote":"Don't envy for what people have and you don't. You have something they don't have.","name":"Best Life Quotes"},{"quote":"Don't fear death but rather a life unlived. You don't have to live forever, you just have to live.","name":"Best Life Quotes"},{"quote":"Don't go out there and search, because you won't find it. Don't go sit there and wait, because it won't come to you. Just live your life and see what will cross your path","name":"Best Life Quotes"},{"quote":"Don't judge a book by its cover. Because what you see on the outside, could be a whole different story on the inside","name":"Best Life Quotes"},{"quote":"Don't let anyone ever make you feel like you don't deserve what you want","name":"Best Life Quotes"},{"quote":"Don't let anyone ever make you feel like you don't deserve what you want.","name":"Best Life Quotes"},{"quote":"Don't let fantasy have too much control over your mind, or take reality too much to heart.","name":"Best Life Quotes"},{"quote":"Don't let your ears witness what your eyes didn't see...& don't let your mouth speak what your heart doesn't feel.","name":"Best Life Quotes"},{"quote":"Don't listen or think about anything other people say about you. Just live your life and prove them wrong.","name":"Best Life Quotes"},{"quote":"Don't look down on people. Don't look up to people. Just keep looking ahead and you'll be alright.","name":"Best Life Quotes"},{"quote":"Don't make a promise that you're not willing to stand by.","name":"Best Life Quotes"},{"quote":"Don't make someone a priority in your life when you just an option in theirs.","name":"Best Life Quotes"},{"quote":"Don't pick the better person. Pick the person that makes you better.","name":"Best Life Quotes"},{"quote":"Don't put words in my mouth. And the words that do come out of my mouth don't get them twisted! (:","name":"Best Life Quotes"},{"quote":"Don't respect someone for making a promise. Respect them for keeping it","name":"Best Life Quotes"},{"quote":"Don't run too fast in your life because the most important things in life are hidden","name":"Best Life Quotes"},{"quote":"Don't stress over what could've been, chances are if it should've been, it would've been.","name":"Best Life Quotes"},{"quote":"Don't take life too seriously, you'll never get out alive.","name":"Best Life Quotes"},{"quote":"Don't take life too seriously. Punch it in the face when it needs a good hit. Laugh at it.","name":"Best Life Quotes"},{"quote":"Don't take other people's heart for granted. Don't let anyone take your heart for granted.","name":"Best Life Quotes"},{"quote":"Don't take what you can't give and don't give what you might regret.","name":"Best Life Quotes"},{"quote":"Don't think U know it just because U heard it, instead, WALK it, TALK it, LIVE it then you may actually GET IT!!! ~Take care of your Life~","name":"Best Life Quotes"},{"quote":"Don't think you're the best when you're at the top. Don't think you're the worst when you're at the bottom.","name":"Best Life Quotes"},{"quote":"Don't try to find a point behind everything, find a purpose.","name":"Best Life Quotes"},{"quote":"Don't walk in front of me; I may not follow. Don't walk behind me; I may not lead. Just walk beside me and be my friend.","name":"Best Life Quotes"},{"quote":"Don`t go that extra mile for someone who isn`t even worth the run.","name":"Best Life Quotes"},{"quote":"Dont count your days. Make your days count.","name":"Best Life Quotes"},{"quote":"Dont use your words to describe the situation. Use your words to change the situation.","name":"Best Life Quotes"},{"quote":"Don’t ever be afraid of change. Always remember God will never take anything away from you without the intention of replacing it with something much better.","name":"Best Life Quotes"},{"quote":"Don’t fear the enemy that attacks you, but the false friend that hugs you. Careful who you trust don’t be naive.","name":"Best Life Quotes"},{"quote":"Don’t feel bad. A lot of people have no talent.","name":"Best Life Quotes"},{"quote":"Don’t gain the world and lose your soul, wisdom is better than silver or gold.","name":"Best Life Quotes"},{"quote":"Don’t judge me by the mistakes I have made, but by what I’ve learned from them.","name":"Best Life Quotes"},{"quote":"Don’t let time sneak up on you. Enjoy every moment that you can.","name":"Best Life Quotes"},{"quote":"Don’t let yourself be controlled by these 3 things. Your past, people & money.","name":"Best Life Quotes"},{"quote":"Don’t lose hope. When the SUN goes down, the STARS come out.","name":"Best Life Quotes"},{"quote":"Don’t prioritize your friends over your family. Friends come and go but your family will be with you even when you’ve fallen.","name":"Best Life Quotes"},{"quote":"Don’t think of the things you didn’t get after praying. Think of the countless blessings God gave you without asking.","name":"Best Life Quotes"},{"quote":"Don’t think too much. You’ll create a problem that wasn’t even there in the first place.","name":"Best Life Quotes"},{"quote":"Dream your dreams with your eyes closed, but live your dreams with your eyes open.","name":"Best Life Quotes"},{"quote":"Dreams grow if you grow.","name":"Best Life Quotes"},{"quote":"During a negotiation, it would be wise not to take anything personally. If you leave personalities out of it, you will be able to see opportunities more objectively.","name":"Best Life Quotes"},{"quote":"Each friend represents a world in us, a world possibly not born until they arrive, and it is only by this meeting that a new world is born.","name":"Best Life Quotes"},{"quote":"Each night, when I go to sleep, I die. And the next morning, when I wake up, I am reborn.","name":"Best Life Quotes"},{"quote":"Effective leadership is not about making speeches or being liked; leadership is defined by results not attributes.","name":"Best Life Quotes"},{"quote":"Either write something worth reading or do something worth writing.","name":"Best Life Quotes"},{"quote":"Enjoy the little things in life, for one day you may look back and realize they were the big things.","name":"Best Life Quotes"},{"quote":"Enjoy the little things, for one day you may look back and realize they were the big things..","name":"Best Life Quotes"},{"quote":"Enjoy your body. Don't be afraid of what people might think of you. Your flaws are what make you beautiful.","name":"Best Life Quotes"},{"quote":"Even behind the grayest cloud, lies one beautiful blue sky.","name":"Best Life Quotes"},{"quote":"Even the prettiest flower will wilt one day. It's nature's way of teaching us that nothing lasts forever.","name":"Best Life Quotes"},{"quote":"Even when you think you have no more to give, when a friend cries out to you, you will find the strength to help.","name":"Best Life Quotes"},{"quote":"Ever looked at your EX and wondered “Was I drunk the entire relationship”.","name":"Best Life Quotes"},{"quote":"Every adversity has the seed of an equivalent or greater benefit","name":"Best Life Quotes"},{"quote":"Every choice you make has an end result.","name":"Best Life Quotes"},{"quote":"Every choice you make isn't always going to be the right one . But you have to live & learn","name":"Best Life Quotes"},{"quote":"Every day life gave us an opportunity to learn something from every situation.... take advantage from that opportunity.","name":"Best Life Quotes"},{"quote":"Every day may not be good, but there's something good in everyday","name":"Best Life Quotes"},{"quote":"Every heart has a pain. Only the way of expressing it is different. Fools hide it in eyes, while brilliant hide it in their smile.","name":"Best Life Quotes"},{"quote":"Every night we go to bed without any assurance of being alive the next morning but still we set the alarm to wake up.. That’s called hope.","name":"Best Life Quotes"},{"quote":"Every oak tree started out as a couple of nuts who decided to stand their ground","name":"Best Life Quotes"},{"quote":"Every second of your life can be magnificent. You can turn a rainy day on a sunny day. It only depends on you","name":"Best Life Quotes"},{"quote":"Every second of your life can be magnificent. You can turn a rainy day on a sunny day. It only depends on you.","name":"Best Life Quotes"},{"quote":"Every single moment counts. When you add them all up, they equal your life.","name":"Best Life Quotes"},{"quote":"Every woman is wrong until she cries, and then she is right, instantly.","name":"Best Life Quotes"},{"quote":"Everybody’s a self-made man, but only the successful ones are ever willing to admit it","name":"Best Life Quotes"},{"quote":"Everyday passes by and i am one step closer to the best thing in my life.","name":"Best Life Quotes"},{"quote":"Everyone can say they care but not everyone can prove it.","name":"Best Life Quotes"},{"quote":"Everyone deserves a second chance, even the ones who didn't deserve the first.","name":"Best Life Quotes"},{"quote":"Everyone gets hit by life, but it's about how many hits you can take to keep moving forward","name":"Best Life Quotes"},{"quote":"Everyone has the power to make someone else happy.. Some do it just by entering the room, while others do it by leaving.","name":"Best Life Quotes"},{"quote":"Everyone has their own story to tell, but some actually do tell it while others keep it a secret.","name":"Best Life Quotes"},{"quote":"Everyone is trying to accomplish something big, not realizing that life is made up of little things.","name":"Best Life Quotes"},{"quote":"Everyone says that they're lost..I am not lost, I know exactly where I am, I just hate it here","name":"Best Life Quotes"},{"quote":"Everyone wants to be someone’s everything.","name":"Best Life Quotes"},{"quote":"Everyone wants to be the sun that lights up your life. But I'd rather be your moon, so I can shine on you during your darkest hour when your sun isn't around.","name":"Best Life Quotes"},{"quote":"Everything I like is either Illegal, Immoral, Fattening, Addictive, Expensive, or Impossible.","name":"Best Life Quotes"},{"quote":"Everything aren't for everybody!!!!! Real Talk!!!!! Stick to what you know!!!!","name":"Best Life Quotes"},{"quote":"Everything happens for a reason, nothing lasts forever. Welcome to life, where anything goes.","name":"Best Life Quotes"},{"quote":"Everything happens for a reason, the hard part is finding that reason.","name":"Best Life Quotes"},{"quote":"Everything happens for a reason. I will stand for that until the day I die.","name":"Best Life Quotes"},{"quote":"Everything happens for a reason. I will stand for that until the day i die.","name":"Best Life Quotes"},{"quote":"Everything happens for a reason. Maybe you don't see the reason right now, but when it is finally revealed..it will blow you away.","name":"Best Life Quotes"},{"quote":"Everything may be pre-written but nothing can be rewritten!","name":"Best Life Quotes"},{"quote":"Everything works out in the end, even though it's not how you may have expected it works out.","name":"Best Life Quotes"},{"quote":"Everything you can imagine is real","name":"Best Life Quotes"},{"quote":"Expect nothing, to avoid disappointment, & so everything giving to you will come as a pleasant surprise","name":"Best Life Quotes"},{"quote":"Expect the best. Prepare for the worst. Capitalize on what comes.","name":"Best Life Quotes"},{"quote":"Expecting the world to treat you fairly because you are good is like expecting the bull not to charge because you are a vegetarian.","name":"Best Life Quotes"},{"quote":"Facebook is the only book that we read everyday.","name":"Best Life Quotes"},{"quote":"Facebook really needs a `No one cares` button..","name":"Best Life Quotes"},{"quote":"Fake is the new trend and everyone seems to be in style.!!!","name":"Best Life Quotes"},{"quote":"Falling in live is like jumping off a really tall building, your brain tells you it is not a good idea, but your heart tells you, you can fly.","name":"Best Life Quotes"},{"quote":"False friends are magicians, they vanish in broad daylight if you need them.....","name":"Best Life Quotes"},{"quote":"Fatigue is the best pillow.","name":"Best Life Quotes"},{"quote":"Fear often comes from those things we want the most","name":"Best Life Quotes"},{"quote":"Find a heart that will love you at your worst and arms that will hold you at your weakest.","name":"Best Life Quotes"},{"quote":"Follow your feelings. If it feels right, move forward. If it doesn't feel right, don't do it.","name":"Best Life Quotes"},{"quote":"Follow your heart, but be quiet for a while first. Ask questions, and then feel the answer. Learn to trust your heart.","name":"Best Life Quotes"},{"quote":"For last year's words belong to last year's language and next year's words await another voice.","name":"Best Life Quotes"},{"quote":"For my part I know nothing with any certainty, but the sight of the stars makes me dream.","name":"Best Life Quotes"},{"quote":"Forget about all the reasons why something may not work. You only need to find one good reason why it will","name":"Best Life Quotes"},{"quote":"Forget all the reasons it won't work believe the one reason it will","name":"Best Life Quotes"},{"quote":"Forget all the reasons it won?t work and believe the one reason that it will.","name":"Best Life Quotes"},{"quote":"Forgive someone because you believe they are truly sorry, not just because you just want to keep them in your life.","name":"Best Life Quotes"},{"quote":"Forgiving is easy, forgetting is hard.","name":"Best Life Quotes"},{"quote":"From the worst moments you can learn the most.","name":"Best Life Quotes"},{"quote":"GOD understands our prayers even when we can’t find the words.","name":"Best Life Quotes"},{"quote":"Getting what you want is not nearly as important as giving what you have","name":"Best Life Quotes"},{"quote":"Girls, being beautiful doesn’t make you nice. Being nice makes you beautiful..","name":"Best Life Quotes"},{"quote":"Give the world the best you have and the best will come back to you...","name":"Best Life Quotes"},{"quote":"Go confidently in the direction of your dreams. Live the life you have imagined.","name":"Best Life Quotes"},{"quote":"Go for someone who isn't only proud to have you, but will also take every risk just to be with you!!","name":"Best Life Quotes"},{"quote":"God Gives every bird it’s food, But he does not throw it into it’s nest.","name":"Best Life Quotes"},{"quote":"God gave you a gift of 86,400 seconds today. Have you used one to say “thank you”?","name":"Best Life Quotes"},{"quote":"God has made someone for everyone and I know it is you with whom I would like to be forever.","name":"Best Life Quotes"},{"quote":"God might have taken something from you now but he will never leave you empty handed.","name":"Best Life Quotes"},{"quote":"God often removes someone from your life for a reason. Think before you chase after them.","name":"Best Life Quotes"},{"quote":"Good or bad, whatever you do will come back in one form or another; that would explain why the earth is round","name":"Best Life Quotes"},{"quote":"Good relationships are like trees. They provide shade to us shade in all situations of life.","name":"Best Life Quotes"},{"quote":"Good things come in good time.","name":"Best Life Quotes"},{"quote":"Good things come to those who wait, but better things come to those who work for it!!","name":"Best Life Quotes"},{"quote":"Good things come to those who wait? greater things come to those who get off their ass and do anything to make it happen.","name":"Best Life Quotes"},{"quote":"Great accomplishments do not come from people who wait until conditions are perfect. Great accomplishments come from those who are determined to begin working, right here and right now, to make things better.!!","name":"Best Life Quotes"},{"quote":"Great opportunities to help others seldom come, but small ones surround us daily.","name":"Best Life Quotes"},{"quote":"Growing old is mandatory, growing up is optional.","name":"Best Life Quotes"},{"quote":"Half a truth is often a great lie.","name":"Best Life Quotes"},{"quote":"Happiness is the only thing you can give without having.","name":"Best Life Quotes"},{"quote":"Harsh words hurt feelings but silence breaks hearts.","name":"Best Life Quotes"},{"quote":"Hate is hate. Love is love. How you define and represent them both is up to you.","name":"Best Life Quotes"},{"quote":"Hate is not the first enemy of love. Fear is. It destroys your ability to trust.","name":"Best Life Quotes"},{"quote":"Haters only hate the people they can?t have or the people they can?t be.","name":"Best Life Quotes"},{"quote":"Hatred is like acid, it destroys both the person it's poured upon and the person it's contained within!!","name":"Best Life Quotes"},{"quote":"Have FAITH in your FAITH. There IS a blessing in the breaking!","name":"Best Life Quotes"},{"quote":"Have a heart that never hardens a temper that never tires, and a touch that never hurts.","name":"Best Life Quotes"},{"quote":"Have a heart that never hardens, a temper that never tires, and a touch that never hurts.","name":"Best Life Quotes"},{"quote":"Have faith. When GOD gives you a dream, he will give you the opportunities to achieve it.","name":"Best Life Quotes"},{"quote":"Have you ever had the feeling that your eyes are just telling too much about you to the others around you??","name":"Best Life Quotes"},{"quote":"He who has learned to disagree without being disagreeable has discovered the most valuable secret of a diplomat.","name":"Best Life Quotes"},{"quote":"He who would learn to fly one day must first learn to stand and walk and run and climb and dance; one cannot fly into flying.","name":"Best Life Quotes"},{"quote":"Holding anger is a poison. It eats you from the inside. We think that hating is a weapon that attacks the person who harmed us. But hatred is a curved blade. And the harm we do, we do to ourselves","name":"Best Life Quotes"},{"quote":"Honesty is the best policy.","name":"Best Life Quotes"},{"quote":"How many people do you have in your life that you can actually say are worth the pain?","name":"Best Life Quotes"},{"quote":"How wonderful it is that nobody need wait a single moment before starting to improve the world.","name":"Best Life Quotes"},{"quote":"Hunger is the best pickle.","name":"Best Life Quotes"},{"quote":"I Guess I'm Always Afraid Of Being Happy, Because Whenever Life Seems To Be So Perfect, Something Bad Always Seems To Happen","name":"Best Life Quotes"},{"quote":"I Kn0w That I'm n0t The Best...But I Als0 Kn0w That I'M n0t Like The REST.","name":"Best Life Quotes"},{"quote":"I Pay no mind to those who talk behind my back, it simply means that I am two steps ahead.","name":"Best Life Quotes"},{"quote":"I act as everything's fine, but underneath it all I'm screaming.","name":"Best Life Quotes"},{"quote":"I always try to cheer my friends up when they're sad, but I can't even cheer myself up.","name":"Best Life Quotes"},{"quote":"I am 99% sure that she doesn’t like me but it’s that 1% that keep me hangin on.","name":"Best Life Quotes"},{"quote":"I am crushing on the road of life but I need a passenger","name":"Best Life Quotes"},{"quote":"I am listening to you, I am just not paying attention","name":"Best Life Quotes"},{"quote":"I am not perfect but loving you makes me the best. ♥","name":"Best Life Quotes"},{"quote":"I am on a Journey and I honestly do not know for certain what my destination will be, Yet for some odd reason, Not knowing is what inspires me to keep going...","name":"Best Life Quotes"},{"quote":"I am single but not available.","name":"Best Life Quotes"},{"quote":"I am thankful to all those people who ever said NO to me... It was because of them I did it all myself.","name":"Best Life Quotes"},{"quote":"I believe GOD per perfect plan for my life!","name":"Best Life Quotes"},{"quote":"I believe life is an intelligent thing: that things aren't random.","name":"Best Life Quotes"},{"quote":"I believe that the sun shines after the rain....I believe if you don't get hurt you'll never gain...I believe in not doing things the easy way....I believe that being selfish doesn't pay....I believe in a second chance.","name":"Best Life Quotes"},{"quote":"I can talk to hundreds of people in one day, but none of them compare to the smile you can give me in one minute.","name":"Best Life Quotes"},{"quote":"I can't promise you that everything will be okay. But I can promise you that you'll never have to face things alone.","name":"Best Life Quotes"},{"quote":"I didn't think it was possible to find someone more confusing than me. Then, you came along.","name":"Best Life Quotes"},{"quote":"I do believe that GOD above put me here for you to LOVE. He picked you out among the rest because he know I’d love you best.","name":"Best Life Quotes"},{"quote":"I do not think there is any other quality so essential to success of any kind as the quality of perseverance. It overcomes almost everything, even nature.","name":"Best Life Quotes"},{"quote":"I don't just need a happy ending, I need a happy beginning too.","name":"Best Life Quotes"},{"quote":"I don't know what we're put on this planet to do but we're here damn it!","name":"Best Life Quotes"},{"quote":"I don't want to 'fit in' I want to stand out. I want the world to know I was here. That I made a difference.","name":"Best Life Quotes"},{"quote":"I don't want to get to the end of my life and find that I have just lived the length of it. I want to have lived the width of it as well.","name":"Best Life Quotes"},{"quote":"I dont care if anyone does not like me. I was not born in this world to entertain everyone.","name":"Best Life Quotes"},{"quote":"I dont want a relation where people say they look so cute together. I need a relation where people say, Look how happy they are together.","name":"Best Life Quotes"},{"quote":"I don’t have ABS or orgasmic shoulder muscles but I have a Heart that will treat you right.","name":"Best Life Quotes"},{"quote":"I don’t want to be your whole world. Just your favorite part in it.","name":"Best Life Quotes"},{"quote":"I fly with my own wings...get off of mine and get your own","name":"Best Life Quotes"},{"quote":"I found the reason to smile, the day I found you.","name":"Best Life Quotes"},{"quote":"I guess you have to trust that things are going to turn out the way they're supposed to, and that you'll be okay in the end.","name":"Best Life Quotes"},{"quote":"I have a simple philosophy: Fill what's empty. Empty what's full. Scratch where it itches.","name":"Best Life Quotes"},{"quote":"I have secrets and I trust no one, cause I know that no matter what, I'll get hurt in the end.","name":"Best Life Quotes"},{"quote":"I have the reasons to cry the river, but I don't have the strength to build the bridge nor the heart to get over it.","name":"Best Life Quotes"},{"quote":"I hope and pray that everything works out for you, that the pain you feel will leave, any stress or uncertainty will melt away, and everything that you strive for will fall into place.","name":"Best Life Quotes"},{"quote":"I just want a person to come into my life and make me say Wow! instead of Why?","name":"Best Life Quotes"},{"quote":"I know eventually it will all be alright but right now it’s not.","name":"Best Life Quotes"},{"quote":"I know they say what goes around comes around.. I just hope you think of me when it does.","name":"Best Life Quotes"},{"quote":"I learn that life is a book. every day is a new page. every month is a new chapter. And every year is a new series.","name":"Best Life Quotes"},{"quote":"I learned this, at least, by my experiment: that if one advances confidently in the direction of his dreams, and endeavors to live the life which he had imagined, he will meet with a success unexpected in common hours.","name":"Best Life Quotes"},{"quote":"I like nonsense, it wakes up the brain cells. Fantasy is a necessary ingredient in living, it's a way of looking at life through the wrong end of a telescope. Which is what I do, and that enables you to laugh at life's realities.","name":"Best Life Quotes"},{"quote":"I like to pretend that everything is alright. Because when everybody else thinks you are fine, sometimes you forget for a while that you’re not.","name":"Best Life Quotes"},{"quote":"I love photos because the best thing about them is that they never change even when the people in them change and they remind you of the amazing feelings.","name":"Best Life Quotes"},{"quote":"I love thosee random memories that make me smile no matter what is going on in my life right now.","name":"Best Life Quotes"},{"quote":"I love you more today than I did yesterday, but not as much as I will tomorow.","name":"Best Life Quotes"},{"quote":"I love you so much that it hurts not having you by my side with each passing day. I miss you, I need you, I want you.","name":"Best Life Quotes"},{"quote":"I may be quiet, but I have so much on my mind. :|","name":"Best Life Quotes"},{"quote":"I may look happy, but you have no idea what's happening inside me.","name":"Best Life Quotes"},{"quote":"I may not be the best but I’m definitely not like the rest.","name":"Best Life Quotes"},{"quote":"I may not be your 1st love, 1st kiss, 1st sight, or 1st date but I just want to be your last.","name":"Best Life Quotes"},{"quote":"I may not have gone where I intended to go, but I think I have ended up where I needed to be","name":"Best Life Quotes"},{"quote":"I may not like the things I’ve done, but they made me love what I’ve become.","name":"Best Life Quotes"},{"quote":"I might not be the best, but I’ll give you my best.","name":"Best Life Quotes"},{"quote":"I myself am made entirely of flaws, stitched together with good intentions","name":"Best Life Quotes"},{"quote":"I never see what has been done; I only see what remains to be done.","name":"Best Life Quotes"},{"quote":"I never wanted to be famous. I only wanted to be great.","name":"Best Life Quotes"},{"quote":"I read because it takes me away, away to a place where anything is possible","name":"Best Life Quotes"},{"quote":"I sit here and wonder if you’ll ever understand just how much of me belongs to you.","name":"Best Life Quotes"},{"quote":"I speak to everyone in the same way, whether he is the garbage man or the president of the university.","name":"Best Life Quotes"},{"quote":"I started out with nothing and I still have most of it left.","name":"Best Life Quotes"},{"quote":"I still remember the feeling I felt when I first started talking to you.","name":"Best Life Quotes"},{"quote":"I think its time I let go of the past, live in the present, and look forward to the future.","name":"Best Life Quotes"},{"quote":"I thought I lost you but then I realized that you were never mine.","name":"Best Life Quotes"},{"quote":"I turned out liking you a lot more than I originally planned.","name":"Best Life Quotes"},{"quote":"I used to think that life had a plan for me, until I realized life had to be planned by me...","name":"Best Life Quotes"},{"quote":"I want to be the one who makes you smile.","name":"Best Life Quotes"},{"quote":"I want to put a ding in the universe.","name":"Best Life Quotes"},{"quote":"I was your cure, you were my disease. I was saving you, but you were killing me.","name":"Best Life Quotes"},{"quote":"I will take care of you more than I do to my self.","name":"Best Life Quotes"},{"quote":"I wish I could add myself as a friend. That's the only person I can depend on now a days.","name":"Best Life Quotes"},{"quote":"I wish I could go back in time and find you sooner, that way I could love you longer.","name":"Best Life Quotes"},{"quote":"I wish I could press fast forward to see if it's actually worth it","name":"Best Life Quotes"},{"quote":"I wish memories were text messages...you could delete the ones you don't want and keep the special ones forever!!!","name":"Best Life Quotes"},{"quote":"I wish to belong to you, I’ll be the one you’re looking for and we’ll be the one heaven’s searching for!","name":"Best Life Quotes"},{"quote":"I woke up feeling like I'm going to conquer the world. I like this","name":"Best Life Quotes"},{"quote":"I wonder what the person I’m going to marry is doing right now.","name":"Best Life Quotes"},{"quote":"I'm afraid that if i want something too much that it'll mean I'll never have it.","name":"Best Life Quotes"},{"quote":"I'm capable of doing anything I want. Then again, I'm capable of doing things I wish I wouldn't have done.","name":"Best Life Quotes"},{"quote":"I'm not afraid of death; I just don't want to be there when it happens.","name":"Best Life Quotes"},{"quote":"I'm not saying I'm perfect. In fact, I'm far from it; I'm just saying I'm worth it.","name":"Best Life Quotes"},{"quote":"I'm not sure if life is passing me by or trying to run me over.","name":"Best Life Quotes"},{"quote":"I've been let down, put down, and knocked down, but I'M STILL STANDING","name":"Best Life Quotes"},{"quote":"I've kept the tears in for so long that i don't really remember how to cry anymore..","name":"Best Life Quotes"},{"quote":"I've learned if a person doesn't treat you with respect, then they don't deserve yours.","name":"Best Life Quotes"},{"quote":"I've learned that it's better to not expect anything from someone because in the end they only let you down","name":"Best Life Quotes"},{"quote":"I've learned that no matter how much I care, some people just don't care back and some people do and I really appreciate it.!!","name":"Best Life Quotes"},{"quote":"I've never regretted anything I've done. Only things that I haven't done.","name":"Best Life Quotes"},{"quote":"IF YOU ALWAYS DO WHAT YOU HAVE ALWAYS DONE, YOU WILL ALWAYS GET WHAT YOU HAVE ALWAYS GOTTEN!","name":"Best Life Quotes"},{"quote":"I`m in love with your statuses. You always make me smile…","name":"Best Life Quotes"},{"quote":"Identify your problems but give your power and energy to solutions.","name":"Best Life Quotes"},{"quote":"If everything seems under control, you're just not going fast enough","name":"Best Life Quotes"},{"quote":"If everything seems under control, you're just not going fast enough.","name":"Best Life Quotes"},{"quote":"If everything seems under control... You're just not going fast enough!","name":"Best Life Quotes"},{"quote":"If good things come to those who wait, something spectacular must be coming my way.. .. I've been waiting long enough","name":"Best Life Quotes"},{"quote":"If it comes down between what your heart is telling you and what your brain is telling you. Listen to your heart, because that's what you want more.","name":"Best Life Quotes"},{"quote":"If it didn't matter, you wouldn't be thinking about it.","name":"Best Life Quotes"},{"quote":"If it does not feel right to you, then maybe it’s not right for you.","name":"Best Life Quotes"},{"quote":"If it is important to you, you will find a way. If not, you will find an excuse.","name":"Best Life Quotes"},{"quote":"If others are jealous, you're doing something right","name":"Best Life Quotes"},{"quote":"If people talk about you behind your back, it's because you're ahead of them.","name":"Best Life Quotes"},{"quote":"If someone has something bad to say about you, it's probably because they have nothing good to say about themselves.","name":"Best Life Quotes"},{"quote":"If someone is bringing you down, cut them out of your life. It's that simple.","name":"Best Life Quotes"},{"quote":"If someone really loves you, they wouldn’t let you slip away no matter how hard the situation is.","name":"Best Life Quotes"},{"quote":"If there is one lesson I am happy to take from life it is this. Life can tear you apart it can rip you end from end. But even with a broken heart we can prevail, humans are amazing creatures and that is what makes this journey worth it. Even if the path crosses into hell it is still worth the ride.","name":"Best Life Quotes"},{"quote":"If they let you down once chances are they will do it again and again and again and again! Be-careful who you trust and how many chances they get!","name":"Best Life Quotes"},{"quote":"If things go wrong, don't go with them.","name":"Best Life Quotes"},{"quote":"If this is what winning feels like, can I lose?","name":"Best Life Quotes"},{"quote":"If u find the enemy fighting u then there is something unique, special n great about u, if the enemy never fights u then it means u have already compromised n joined him n u r no longer a threat to him, when the enemy brings a battle to u then understand that u r more than a conqueror n behind every battle there is a HIDDEN BLESSING!","name":"Best Life Quotes"},{"quote":"If we all worked on the assumption that what is accepted as true is really true, there would be little hope of advance.","name":"Best Life Quotes"},{"quote":"If you are facing in the right direction, all you need to do is keep on walking.","name":"Best Life Quotes"},{"quote":"If you are going to talk, let it mean something. People talk and spread lies\/rumors, just to see who's miserable enough to listen, All you end up saying is a lot of nothing to no one.","name":"Best Life Quotes"},{"quote":"If you are honest and frank, people may cheat you, Be honest and frank anyway.","name":"Best Life Quotes"},{"quote":"If you are honest and frank, people may cheat you. Be honest and frank anyway.","name":"Best Life Quotes"},{"quote":"If you are kind, people may accuse you of selfish, ulterior motives. Be kind anyway.","name":"Best Life Quotes"},{"quote":"If you are planning on doing business with someone again, don't be too tough in the negotiations. If you're going to skin a cat, don't keep it as a house cat.","name":"Best Life Quotes"},{"quote":"If you are successful, you will win some false friends and some true enemies, Succeed anyway.","name":"Best Life Quotes"},{"quote":"If you are successful, you will win some false friends and some true enemies. Succeed anyway.","name":"Best Life Quotes"},{"quote":"If you are working on something exciting that you really care about, you don't have to be pushed. The vision pulls you.","name":"Best Life Quotes"},{"quote":"If you cant live for today, live for tomorrow.","name":"Best Life Quotes"},{"quote":"If you come to a negotiation table saying you have the final truth, that you know nothing but the truth and that is final, you will get nothing.","name":"Best Life Quotes"},{"quote":"If you desire many things, many things will seem few.","name":"Best Life Quotes"},{"quote":"If you don't go after what you want, you will never have it.","name":"Best Life Quotes"},{"quote":"If you don't go after what you want, you'll never have it. It's as simple as that.. So, don't wait for miracle to be happening if you're not daring to any effort on it.","name":"Best Life Quotes"},{"quote":"If you don't know where you are going, any road will get you there","name":"Best Life Quotes"},{"quote":"If you don`t want me to cross the line, then don`t draw one.","name":"Best Life Quotes"},{"quote":"If you dont believe in yourself, Do you think anyone else would?","name":"Best Life Quotes"},{"quote":"If you don’t clear your misunderstanding in time they become the reason for distance forever.","name":"Best Life Quotes"},{"quote":"If you don’t thank GOD for every smile, then you have no right to complain about every tear.","name":"Best Life Quotes"},{"quote":"If you had five minutes left to live; what would you do? The first thing that just came to your mind, go do it.","name":"Best Life Quotes"},{"quote":"If you had five minutes left to live; what would you do? The first thing that just came to your mind, go do it. s","name":"Best Life Quotes"},{"quote":"If you have any doubts, you are probably better off without them.","name":"Best Life Quotes"},{"quote":"If you learn from defeat, you haven't really lost.","name":"Best Life Quotes"},{"quote":"If you learn not to have any expectations.....you will never have disappointments","name":"Best Life Quotes"},{"quote":"If you light a lamp for somebody, it will also brighten your path.","name":"Best Life Quotes"},{"quote":"If you like me, tell Me. if you miss me show it and if you love me, PROVE IT.","name":"Best Life Quotes"},{"quote":"If you listen to your fears, you will die never knowing what a great person you might have been.","name":"Best Life Quotes"},{"quote":"If you really want to do something, you'll find a way. If you don't, you'll find an excuse","name":"Best Life Quotes"},{"quote":"If you see nothing wrong with settling for less, then maybe you don't deserve better.","name":"Best Life Quotes"},{"quote":"If you think that you're the only one out there who has ever felt the type of pain your feeling... take a look at the world sweetie. Out of all the billions of people out there, someone knows how you feel. You're never alone.","name":"Best Life Quotes"},{"quote":"If you treat me like an option, I’ll leave you like a choice.","name":"Best Life Quotes"},{"quote":"If you want something different You Gotta do something different.","name":"Best Life Quotes"},{"quote":"If you want to earn more, learn more.","name":"Best Life Quotes"},{"quote":"If you want to know your past, look into your present conditions. If you want to know your future, look into your present actions.","name":"Best Life Quotes"},{"quote":"If you want what you've never had, you have to do what you've never done.","name":"Best Life Quotes"},{"quote":"If your problem has a solution then...why worry about it? If your problem doesn't have solution then why worry about it?","name":"Best Life Quotes"},{"quote":"If you’re absent during my struggle, don’t expect to be present during my success.","name":"Best Life Quotes"},{"quote":"Im not looking for someone who has everything. But someone who has time to spend with me more than anything.","name":"Best Life Quotes"},{"quote":"Impossible only means that you haven't found the solution yet.","name":"Best Life Quotes"},{"quote":"In an emergency, I`d probably write status about it before calling the police.","name":"Best Life Quotes"},{"quote":"In any relationship, when attachment dies, formalities are born and when formalities born then nothing remains.","name":"Best Life Quotes"},{"quote":"In every story, there's someone who doesn't appear too often, but this person has big role to make the ending.","name":"Best Life Quotes"},{"quote":"In life you’ll realize there is a purpose for everyone you meet. Some will test you, some will teach you, and some will use you. But most importantly, some will bring out the best in you.","name":"Best Life Quotes"},{"quote":"In life, problems continuously come and go. It never stops. So just enjoy, learn, and face it!","name":"Best Life Quotes"},{"quote":"In life, the only constant thing, is CHANGE.","name":"Best Life Quotes"},{"quote":"In my opinion as long as I'm still breathing I'm doing something right with my life.","name":"Best Life Quotes"},{"quote":"In the book of life, the most important thing is not to lose your place","name":"Best Life Quotes"},{"quote":"In the end, it's not going to matter how much money you had, what clothes you wore, how you did your hair, and how pretty you are. What will matter is what you made of your life, and what you became.","name":"Best Life Quotes"},{"quote":"In the end, its not going to matter how many mistakes you made, but how you used them to make you a stronger person.","name":"Best Life Quotes"},{"quote":"In three word I can sum up everything I've learned about life: It Goes On.","name":"Best Life Quotes"},{"quote":"In three words I can sum up everything I've learned about life it goes on.","name":"Best Life Quotes"},{"quote":"In three words I can sum up everything I've learned about life: it goes on.","name":"Best Life Quotes"},{"quote":"Industry need not wish.","name":"Best Life Quotes"},{"quote":"Innovation distinguishes between a leader and a follower.","name":"Best Life Quotes"},{"quote":"Insanity is doing the same thing, over and over again, but expecting different results","name":"Best Life Quotes"},{"quote":"Instead of focusing on what’s missing, learn to appreciate what’s there.","name":"Best Life Quotes"},{"quote":"Instead of thinking about what you are missing, try thinking about what you have that everyone else is missing.","name":"Best Life Quotes"},{"quote":"It doesn't matter what cards you're dealt in life, what matters is how well you play them.","name":"Best Life Quotes"},{"quote":"It doesn't matter where you go in life.. It's who you have beside you.","name":"Best Life Quotes"},{"quote":"It doesn’t matter what other people think of you, it only matters what you think of you. Don’t change because one person doesn’t like you.","name":"Best Life Quotes"},{"quote":"It is better to be a lion for a day than a sheep all your life.","name":"Best Life Quotes"},{"quote":"It is easier to prevent bad habits than to break them.","name":"Best Life Quotes"},{"quote":"It is not happy people who are thankful. It is thankful people who are happy.","name":"Best Life Quotes"},{"quote":"It is not he bad memories that make you sad but the best ones that you can’t bring it back.","name":"Best Life Quotes"},{"quote":"It is not what you can do for your country, but what you can do for all of mankind.","name":"Best Life Quotes"},{"quote":"It is so easy to believe someone when they tell you exactly what you want to hear.","name":"Best Life Quotes"},{"quote":"It is true....the world is a stage, that is why some act as if they are someone they are not and avoid who they truly are in order to put on a show worth watching..","name":"Best Life Quotes"},{"quote":"It isn't what you have, or who you are, or where you are, or what you are doing that makes you happy or unhappy. It is what you think about.","name":"Best Life Quotes"},{"quote":"It seems when you want someone, they don’t want you. And when someone wants you, you don’t want them. And when you both want eachother, something has to come around and mess it up.","name":"Best Life Quotes"},{"quote":"It takes a second to make a mistake but a lifetime to forget it was your fault.","name":"Best Life Quotes"},{"quote":"It takes many good deeds to build a good reputation, and only one bad one to lose it. !!","name":"Best Life Quotes"},{"quote":"It takes years to build friendship, years more to build love and only seconds to throw it all away.","name":"Best Life Quotes"},{"quote":"It will be worth it to be with someone who knows your worth.","name":"Best Life Quotes"},{"quote":"It's The Little Things That Makes Living Worthwhile.","name":"Best Life Quotes"},{"quote":"It's a well-known proposition that you know who's going to win a negotiation; it's he who pauses the longest.","name":"Best Life Quotes"},{"quote":"It's easy to believe someone when they tell you exactly what you want to hear.","name":"Best Life Quotes"},{"quote":"It's easy to forget things you want to remember. It's hard to forget things you don't want to remember.","name":"Best Life Quotes"},{"quote":"It's funny. In school you're taught a lesson, then giving a test. But in life, you're giving a test that teaches you a lesson","name":"Best Life Quotes"},{"quote":"It's important that people should know what you stand for. It's equally important that they know what you won't stand for","name":"Best Life Quotes"},{"quote":"It's never too late - never too late to start over, never too late to be happy.s","name":"Best Life Quotes"},{"quote":"It's not about saying the right things, it's about doing the right things.","name":"Best Life Quotes"},{"quote":"It's not the lack of resources, it's your lack of resourcefulness that stops you.","name":"Best Life Quotes"},{"quote":"It's not who you are that holds you back, it's who you think you're not.!","name":"Best Life Quotes"},{"quote":"It's okay to be crazy, it's a little thing called being you.","name":"Best Life Quotes"},{"quote":"It's only after you lost everything that you're willing to try anything.","name":"Best Life Quotes"},{"quote":"It's true that we don't know what we've got until we lose it .... But it's also true that we don't know what we've been missing until it arrives !!","name":"Best Life Quotes"},{"quote":"It's weird how you go from being strangers to being friends to being more than friends to being practically strangers again.","name":"Best Life Quotes"},{"quote":"It`s amazing how much you discover on facebook.","name":"Best Life Quotes"},{"quote":"It`s not official until it`s on facebook.","name":"Best Life Quotes"},{"quote":"Its always better to have faith, even when you think things are all over.","name":"Best Life Quotes"},{"quote":"Its better to let go and see if they come back than to hold on and see if they let go.","name":"Best Life Quotes"},{"quote":"Its better to let go with a smile in face than to hold on with tears in eyes.","name":"Best Life Quotes"},{"quote":"Its mind over matter...I don't mind and you really don't matter","name":"Best Life Quotes"},{"quote":"Its truly amazing what happens when you let go of all the negativity & drama, your days become so much better & easier :)","name":"Best Life Quotes"},{"quote":"It’s beautiful when two strangers become best friends, it’s terribly depressing when two best friends become strangers.","name":"Best Life Quotes"},{"quote":"It’s funny how 1 text, 1 song, 1 mistake, 1 lie, 1 truth and 1 person could change your mood in 1 second.","name":"Best Life Quotes"},{"quote":"It’s hard to answer the question “what’s wrong” when nothings right.","name":"Best Life Quotes"},{"quote":"It’s not a matter of finding the right person but its a matter of being the right person for the one you choose to love.","name":"Best Life Quotes"},{"quote":"It’s so easy to play with love, so easy to fool someone, so easy to make someone cry. But it’s so hard if you’re the one who’s played with, fooled and the one who cried. Respect others and say whatever you feel inside.","name":"Best Life Quotes"},{"quote":"I’m the kind of person that no matter how sad I am, I’m still going to make you smile.","name":"Best Life Quotes"},{"quote":"Just because it's not what you were expecting, doesn't mean it's not everything you've been waiting for...","name":"Best Life Quotes"},{"quote":"Just because one person doesn’t love you don’t mean you should forget about everyone else that does.","name":"Best Life Quotes"},{"quote":"Just because something good ends doesn't mean something better won't begin.","name":"Best Life Quotes"},{"quote":"Just because things are not good now does not mean they will be that way forever.","name":"Best Life Quotes"},{"quote":"Just because we don't talk anymore, doesn't mean that I don't care about you any less than I did before.","name":"Best Life Quotes"},{"quote":"Just because you cant see the air doesn’t mean you stop breathing. And just because you cant see God doesn’t mean you stop believing.","name":"Best Life Quotes"},{"quote":"Just because you didn't see me doesn't mean that I wasn't there","name":"Best Life Quotes"},{"quote":"Just because you didn't see me doesn't mean that I wasn't there.","name":"Best Life Quotes"},{"quote":"Just because you have a heart, it does not make you a human. You need to have emotions in that.","name":"Best Life Quotes"},{"quote":"Just because you lose the battle, doesn't mean you lose the war","name":"Best Life Quotes"},{"quote":"Just because you think your way is right, doesn't mean all people must follow your way.","name":"Best Life Quotes"},{"quote":"Just like a shoe, if someone is meant for you, they will fit perfectly; no forcing, no struggling, no pain.","name":"Best Life Quotes"},{"quote":"Just remember, calling someone stupid is not going to make you any smarter.","name":"Best Life Quotes"},{"quote":"Just remember; someone loves everything you hate about yourself.","name":"Best Life Quotes"},{"quote":"Just when things got too bad.. I learned how to take life as a joke","name":"Best Life Quotes"},{"quote":"Just when you think it can't get any worse, it can. And just when you think it can't get any better, it can","name":"Best Life Quotes"},{"quote":"Keep smiling, b’coz life is a beautiful thing and there’s so much to smile about.","name":"Best Life Quotes"},{"quote":"Keep your face to the sunshine and you will not see the shadows","name":"Best Life Quotes"},{"quote":"Keep your head up. GOD gives his hardest battles to his strongest soldiers.","name":"Best Life Quotes"},{"quote":"Kind words can be short and easy to speak, but their echoes are truly endless.","name":"Best Life Quotes"},{"quote":"Know yourself, and know your opponent. They are never as strong as you think, and never as weak either.","name":"Best Life Quotes"},{"quote":"Knowing HOW to think empowers you far more than those who only know WHAT to think.","name":"Best Life Quotes"},{"quote":"Knowledge can cure ignorance, but intelligence cannot cure stupidity.","name":"Best Life Quotes"},{"quote":"LADIES: It's not the clothes that make you look beautiful. It's YOU that make the clothes look beautiful. :)","name":"Best Life Quotes"},{"quote":"Learn from yesterday, live for today and hope for tomorrow.","name":"Best Life Quotes"},{"quote":"Learn how to be happy with what you have while you pursue all that you want.","name":"Best Life Quotes"},{"quote":"Learn this from water: loud splashes the brook but the oceans depth are calm.","name":"Best Life Quotes"},{"quote":"Learn to appreciate what you have before time forces you to appreciate what you had","name":"Best Life Quotes"},{"quote":"Learn to forgive people who hurt you before your bitterness makes your life more complicated.","name":"Best Life Quotes"},{"quote":"Learn to let go of the things that makes you hurt, it doesn't belong to you. Because every people deserve to be happy.","name":"Best Life Quotes"},{"quote":"Let us never negotiate out of fear. But let us never fear to negotiate.","name":"Best Life Quotes"},{"quote":"Let us not love in word or talk but in deed and in truth.","name":"Best Life Quotes"},{"quote":"Letting go of the bad memories, makes room for the good memories.","name":"Best Life Quotes"},{"quote":"Life always has many things to bring you down. But, what can really bring you down is your attitude.","name":"Best Life Quotes"},{"quote":"Life becomes easier when you let go of the unneeded stress. If it's out of your control, don't let it worry you.","name":"Best Life Quotes"},{"quote":"Life can only be understood backwards, but it must be lived forward.","name":"Best Life Quotes"},{"quote":"Life can only be understood backwards, but it must be lived forward..","name":"Best Life Quotes"},{"quote":"Life doesn't always make sense and I don't think its such a bad thing","name":"Best Life Quotes"},{"quote":"Life doesn't always make sense and i don't think its such a bad thing","name":"Best Life Quotes"},{"quote":"Life ends when you stop dreaming, hope ends when you stop believing and love ends when you stop caring. So dream hope and love makes life beautiful.","name":"Best Life Quotes"},{"quote":"Life has many different chapters for us. One bad chapter doesn't mean the end of the book.","name":"Best Life Quotes"},{"quote":"Life is a dream, the day we die is the day we wake up.","name":"Best Life Quotes"},{"quote":"Life is a fight, and in that fight it doesn't matter how hard you hit or how well you fight. what matters is how hard you can get hit ,and keep on fighting","name":"Best Life Quotes"},{"quote":"Life is a lesson, the trick is to find out what it's trying to teach you","name":"Best Life Quotes"},{"quote":"Life is a lesson; the trick is to find out what it's trying to teach you!","name":"Best Life Quotes"},{"quote":"Life is a one way street no matter how many detours you take, none of them lead back. So enjoy life's every moment, as none of them will happen the same way again.","name":"Best Life Quotes"},{"quote":"Life is about taking risks and never giving up hope, no matter how lost you are, everyone eventually finds their own way.","name":"Best Life Quotes"},{"quote":"Life is all about risks and it requires you to jump. Don't be a person who has to look back and wonder what they would have or could have had. No one waits forever.","name":"Best Life Quotes"},{"quote":"Life is better when you are laughing. Laugh as much as you breathe.","name":"Best Life Quotes"},{"quote":"Life is divided up into the horrible and the miserable.","name":"Best Life Quotes"},{"quote":"Life is harder when you complicate the simple things. Enjoy what you have and live your life.","name":"Best Life Quotes"},{"quote":"Life is just a script to play. The good news is, you can choose a character you want to play","name":"Best Life Quotes"},{"quote":"Life is just a script to play. The good news is, you can choose a character you want to play.","name":"Best Life Quotes"},{"quote":"Life is like a book no matter how many smiles and tears there are, its always got to end.","name":"Best Life Quotes"},{"quote":"Life is like a book; don?t jump to the end to see if it?s worth it. Just enjoy life and fill the pages with beautiful and amazing memories.","name":"Best Life Quotes"},{"quote":"Life is like a mirror … we get the best results when we smile at it :)","name":"Best Life Quotes"},{"quote":"Life is like a snow globe, often it's prettiest AFTER it's been turned upside-down","name":"Best Life Quotes"},{"quote":"Life is like a video game, you never know what's on the next level.","name":"Best Life Quotes"},{"quote":"Life is like monkey bars, got to let go to move on","name":"Best Life Quotes"},{"quote":"Life is like photography, we use the negatives to develop","name":"Best Life Quotes"},{"quote":"Life is like riding a bicycle. To keep your balance, you must keep moving.","name":"Best Life Quotes"},{"quote":"Life is made up of years that mean nothing and moments that mean it all.","name":"Best Life Quotes"},{"quote":"Life is marketing. You should not accept all they offer. Some offers are good, some others are fake.","name":"Best Life Quotes"},{"quote":"Life is meaningless only if we allow it to be. Each of us has the power to give life meaning, to make our time and our bodies and our words into instruments of love and hope.","name":"Best Life Quotes"},{"quote":"Life is meant to be lived by facing the challenges it brings.","name":"Best Life Quotes"},{"quote":"Life is not about what I've done, what I should've done and what I could've done... It's about what I can do and what I will do.","name":"Best Life Quotes"},{"quote":"Life is not always fair, but one thing I am sure of that it does go on and on","name":"Best Life Quotes"},{"quote":"Life is not always what we want it to be. Sometimes, it’s what we never knew we need it to be.","name":"Best Life Quotes"},{"quote":"Life is not fair; get used to it.","name":"Best Life Quotes"},{"quote":"Life is not measured by the number of breaths we take, but by the moments that take our breath away.","name":"Best Life Quotes"},{"quote":"Life is not the amount of breaths you take, its the moments that take your breath away.","name":"Best Life Quotes"},{"quote":"Life is short, live it. Love is rare, grab it. Anger is bad, dump it. Fear is awful, face it. Memories are sweet, cherish it.?.","name":"Best Life Quotes"},{"quote":"Life is so ironic. It takes sadness to know what happiness is, noice to appreciate silence & absence to value presence.","name":"Best Life Quotes"},{"quote":"Life is ten percent what you make it and ninety percent how you take it!","name":"Best Life Quotes"},{"quote":"Life is too short to hide your feelings. Don't be afraid to say what you feel.","name":"Best Life Quotes"},{"quote":"Life is too short to hide your feelings. Don’t be afraid to say what you feel.","name":"Best Life Quotes"},{"quote":"Life is too short to spend it with people you don't like.","name":"Best Life Quotes"},{"quote":"Life is too short to spend with someone who makes your days difficult.","name":"Best Life Quotes"},{"quote":"Life is too short to wake up in the morning with regrets. So love the people who treat you right, forget about the ones who don’t and believe that everything happens for a reason.","name":"Best Life Quotes"},{"quote":"Life is unexplainable. So, don't try to explain it. Just live it","name":"Best Life Quotes"},{"quote":"Life is written in PEN, there's no erasing what you've already written, so keep writing.","name":"Best Life Quotes"},{"quote":"Life isn't hard. People with their needless complications and unnecessary lies make it that way.","name":"Best Life Quotes"},{"quote":"Life moves pretty fast...if you don't stop and look around once in awhile....you're going to miss it!!!","name":"Best Life Quotes"},{"quote":"Life must be lived forward, but can only be understood backwards.","name":"Best Life Quotes"},{"quote":"Life only get's complicated when heart's get involved.","name":"Best Life Quotes"},{"quote":"Life without risks is like Facebook without notifications..","name":"Best Life Quotes"},{"quote":"Life without you would be like a broken pencil…pointless.","name":"Best Life Quotes"},{"quote":"Life's not about the people who act true to your face. It's about the people who remain true behind your back.","name":"Best Life Quotes"},{"quote":"Life: Every second gives you a chance to turn it all around... and every second is a chance for it all to be taken away.","name":"Best Life Quotes"},{"quote":"Life: Just try to survive as long as you can. Then see what happens.","name":"Best Life Quotes"},{"quote":"Like a bag of potato chips, life always gives you half of what you expected","name":"Best Life Quotes"},{"quote":"Listen to the advice and words of others but always make up your own mind.","name":"Best Life Quotes"},{"quote":"Listen to your own voice, your own soul, too many people listen to the noise of the world, instead of themselves.","name":"Best Life Quotes"},{"quote":"Live for today, because yesterday is over and tomorrow may never come.","name":"Best Life Quotes"},{"quote":"Live like a candle which burns itself but gives light to others","name":"Best Life Quotes"},{"quote":"Log Out is the hardest button to press…","name":"Best Life Quotes"},{"quote":"Logic will get you from A to B. Imagination will take you everywhere","name":"Best Life Quotes"},{"quote":"Logic will get you from A to B. Imagination will take you everywhere.","name":"Best Life Quotes"},{"quote":"Look through the front windshield and not the rearview mirror.","name":"Best Life Quotes"},{"quote":"Looking good is the best revenge.","name":"Best Life Quotes"},{"quote":"Lose your pride, lose your patience, lose your mind. But whatever you do, don't lose hope.","name":"Best Life Quotes"},{"quote":"Lost time is never found again.","name":"Best Life Quotes"},{"quote":"Lots of people want to ride with you in the limo, but what you want is someone who will take the bus with you when the limo breaks down.","name":"Best Life Quotes"},{"quote":"Love and Hope is all you need. If you believe, you will always succeed.","name":"Best Life Quotes"},{"quote":"Love bears all things, believes all things, hopes all things, endures all things.","name":"Best Life Quotes"},{"quote":"Love is like the Sun it shines bright and warms your heart.","name":"Best Life Quotes"},{"quote":"Love is the seventh sense which destroys all other 6 senses.","name":"Best Life Quotes"},{"quote":"Loving is the most CREATIVE force in the universe..The memory of loving, the most destructive.","name":"Best Life Quotes"},{"quote":"Loving someone is madness ! I am HAPPY when people call me MAD.","name":"Best Life Quotes"},{"quote":"Making a million friends is not a miracle...the miracle is to make such a friend who can stand with you when millions are against you","name":"Best Life Quotes"},{"quote":"Man cannot discover new oceans unless he has the courage to lose sight of the shore.","name":"Best Life Quotes"},{"quote":"Man can’t discover new oceans until he has the courage to lose sight of the shore.","name":"Best Life Quotes"},{"quote":"Many fine things can be done in a day if you don’t always make that day tomorrow.","name":"Best Life Quotes"},{"quote":"Many people buy things they don't even need, with money they don't even have, trying to impress people they don't even like.","name":"Best Life Quotes"},{"quote":"Maturity is not when we start speaking big things. Its when we start understanding small things.","name":"Best Life Quotes"},{"quote":"May you follow your dreams and always believe in yourself. Keep your eyes on the stars and hope in your heart.","name":"Best Life Quotes"},{"quote":"May you live every day of your life.","name":"Best Life Quotes"},{"quote":"May your heart be happy, may your days be bright, may your roads be smooth, may your burdens be light, may you find the dreams, may you touch the stars, may you never forget, how special you are.","name":"Best Life Quotes"},{"quote":"Maybe you'll have second chance, but it will never be as great as the first one.","name":"Best Life Quotes"},{"quote":"Memories are what warm you up from the inside. But they're also what tear you apart.","name":"Best Life Quotes"},{"quote":"Memories will always stay. Thanks to you they are the best I've ever had.","name":"Best Life Quotes"},{"quote":"Mine is better than ours.","name":"Best Life Quotes"},{"quote":"Most of the shadows of life are caused by standing in our own sunshine.","name":"Best Life Quotes"},{"quote":"Most of the shadows of this life are caused by our standing in our own sunshine.","name":"Best Life Quotes"},{"quote":"Most of us are just about as Happy as we make up our MINDS to be.","name":"Best Life Quotes"},{"quote":"Most people run because deep down, they want to be chased.","name":"Best Life Quotes"},{"quote":"Most people want to be the sun to brighten up your day. But I would rather be the moon that shines down on you in your darkest hour","name":"Best Life Quotes"},{"quote":"My best dreams and worst nightmares have the same people in them.","name":"Best Life Quotes"},{"quote":"My dream was to grow up, Now I don't want to grow up anymore.","name":"Best Life Quotes"},{"quote":"My dream was to grow up, now I don't want to grow up anymore","name":"Best Life Quotes"},{"quote":"My eyes hurt from crying, my heart hurts from trying, my soul hurts from praying...","name":"Best Life Quotes"},{"quote":"My formula for living is quite simple. I get up in the morning and I go to bed at night. In between, I occupy myself as best I can.","name":"Best Life Quotes"},{"quote":"My friends have given me more pain than my enemies.","name":"Best Life Quotes"},{"quote":"My greatest fear in life is not having a big enough impact on someone's life to always be remembered...","name":"Best Life Quotes"},{"quote":"My insomnia is so bad that even when I do sleep I dream about lying awake.","name":"Best Life Quotes"},{"quote":"My life, My choices, My mistakes, My lessons, Not your business.","name":"Best Life Quotes"},{"quote":"My love for you is a journey starting at 4ever and ending at never.","name":"Best Life Quotes"},{"quote":"My parents treated me like I had a brain which caused me to have One.","name":"Best Life Quotes"},{"quote":"My pen and paper will always speak louder and truer than my lips ever can.","name":"Best Life Quotes"},{"quote":"My silence dose not means I forgot... the mountain is silent but have volcano inside","name":"Best Life Quotes"},{"quote":"My silence dose not means I forgot... the mountain is silent but have volcano inside!","name":"Best Life Quotes"},{"quote":"My silence dose not means I forgot..the mountain is silent but have volcano inside!!","name":"Best Life Quotes"},{"quote":"Necessity never made a good bargain.","name":"Best Life Quotes"},{"quote":"Negotiation in the classic diplomatic sense assumes parties more anxious to agree than to disagree.","name":"Best Life Quotes"},{"quote":"Never be afraid to try something new because life gets boring when you stay within the limits of what you already knew","name":"Best Life Quotes"},{"quote":"Never be too proud of who you are & what position you hold because after a game of chess the king & the puns are tossed into the same box.","name":"Best Life Quotes"},{"quote":"Never confuse motion with action.","name":"Best Life Quotes"},{"quote":"Never feel self-pity, the most destructive emotion there is. How awful to be caught up in the terrible squirrel cage of self.","name":"Best Life Quotes"},{"quote":"Never force someone to make a space in their life for you, because if they know your worth, they will surely create one for you.","name":"Best Life Quotes"},{"quote":"Never forget the power of silence, that massively disconcerting pause which goes on and on and may last induce an opponent to babble and backtrack nervously.","name":"Best Life Quotes"},{"quote":"Never forget who was there for you when no one else was.","name":"Best Life Quotes"},{"quote":"Never give up on something or someone that you truly belive in.","name":"Best Life Quotes"},{"quote":"Never give your secret to anyone because if you can’t keep it to yourself don’t expect others to.","name":"Best Life Quotes"},{"quote":"Never judge a book by it’s cover, or even after you have only read a few chapters, you should never voice an opinion until you know the entire story.","name":"Best Life Quotes"},{"quote":"Never laugh at anyone's dreams. People who don't have dreams don't have much.","name":"Best Life Quotes"},{"quote":"Never let life discourage you; Everyone who got where he is had to begin where he was.","name":"Best Life Quotes"},{"quote":"Never make permanant decisions on temporary feelings.","name":"Best Life Quotes"},{"quote":"Never make someone a priority in your life, when you are just an option in theirs.","name":"Best Life Quotes"},{"quote":"Never put your happiness in someone elses hands.","name":"Best Life Quotes"},{"quote":"Never regret anything because at one point its exactly what you wanted.","name":"Best Life Quotes"},{"quote":"Never say never because in life, you always expect the unexpected.","name":"Best Life Quotes"},{"quote":"Never settle for less when you KNOW you deserve the BEST..","name":"Best Life Quotes"},{"quote":"Never stop believing. Magic is just science we don’t understand. Every original idea was considered insanity at first.","name":"Best Life Quotes"},{"quote":"Never tell your problems to anyone…20% don’t care and the other 80% are glad you have them.","name":"Best Life Quotes"},{"quote":"Never turn your back on people just because you found a new way to do things....A detour could always pop up and the people you turned on may be the road you have to take","name":"Best Life Quotes"},{"quote":"Never underestimate anyone. For everyone is given something that other people don't have.","name":"Best Life Quotes"},{"quote":"Never wait for the perfect moment, use the moment and make it perfect.","name":"Best Life Quotes"},{"quote":"Never waste time on someone who does not have time for you. be with someone who will say “time is wasted if I am not with you”","name":"Best Life Quotes"},{"quote":"New information makes new and fresh ideas possible.","name":"Best Life Quotes"},{"quote":"New research shows that you will be dead longer than you will be alive.","name":"Best Life Quotes"},{"quote":"No man can stand on top because he is put there.","name":"Best Life Quotes"},{"quote":"No man is ever worth your tears, and the one that is, will NEVER make you cry.","name":"Best Life Quotes"},{"quote":"No matter how good or bad the thing you have now, it won't last forever.","name":"Best Life Quotes"},{"quote":"No matter how good you are for someone, if he\/she is not good for you, you're not good for each other.","name":"Best Life Quotes"},{"quote":"No matter how great you are, not everyone will like you. That?s life.","name":"Best Life Quotes"},{"quote":"No matter how many gorgeous faces you set your eyes upon, if you already set your heart for someone, you will hardly notice anyone.","name":"Best Life Quotes"},{"quote":"No one can go back and make a brand new start, however anyone can start from now and make a brand new ending.","name":"Best Life Quotes"},{"quote":"No one can go back and make a brand new start, however anyone can start from now and make a brand new ending.  Thank you","name":"Best Life Quotes"},{"quote":"No words are necessary between two loving hearts.","name":"Best Life Quotes"},{"quote":"Not everything is nice about everyone.. But something is surely nice about everyone","name":"Best Life Quotes"},{"quote":"Not everything you have stays forever. But there are things you would be glad to fight for just so you can have them longer.","name":"Best Life Quotes"},{"quote":"Nothing hurts more than realizing he meant everything to you. But you meant nothing to him.","name":"Best Life Quotes"},{"quote":"Nothing in the universe arouses more false hopes than the first four hours of a diet.","name":"Best Life Quotes"},{"quote":"Nothing is impossible. The word itself says 'I'm possible.'","name":"Best Life Quotes"},{"quote":"Nothing is more annoying than being in a bad mood for no apparent reason and being asked 'what's wrong?' over and over again.!!","name":"Best Life Quotes"},{"quote":"Nothing sucks more than that moment during an argument when you realize you're wrong.","name":"Best Life Quotes"},{"quote":"Nothing that's worth while is ever easy. Remember that.","name":"Best Life Quotes"},{"quote":"Nowhere on your birth certificate did it say life would be fair.","name":"Best Life Quotes"},{"quote":"Of all sad words of tongue or pen, the saddest are these, 'It might have been.","name":"Best Life Quotes"},{"quote":"Of all the words of paper and pen, the saddest words are these : what could have been.","name":"Best Life Quotes"},{"quote":"Often in life we forget the things we should remember and remember the things we should forget.","name":"Best Life Quotes"},{"quote":"Once you learn to be happy. You will not tolerate being around anything that takes it away","name":"Best Life Quotes"},{"quote":"One day your life will flash before your eyes. Make sure it's worth watching.","name":"Best Life Quotes"},{"quote":"One day, we will look back to this and say wow those were the days","name":"Best Life Quotes"},{"quote":"One of the best feelings in the world is knowing your presence and absence both mean something to someone.","name":"Best Life Quotes"},{"quote":"One of the best things in life is finding someone who knows all your mistakes and weaknesses and still loves you and wants to be a part of all the craziness ..","name":"Best Life Quotes"},{"quote":"One of the hardest decisions you will ever face in life is choosing whether to walk away or take another step forward.","name":"Best Life Quotes"},{"quote":"One of the hardest things to do is “TRUST”, especially when those whom you “TRUSTED” the most were those who betrayed you.","name":"Best Life Quotes"},{"quote":"One of the most adventurous things left us is to go to bed. For no one can lay a hand on our dreams.","name":"Best Life Quotes"},{"quote":"One of the most important keys to Success is having the discipline to do what you know you should do, even when you dont feel like doing it.","name":"Best Life Quotes"},{"quote":"One of the simplest ways to be happy...... is to let go of all the things that make you sad","name":"Best Life Quotes"},{"quote":"One of the things that may get in the way of people   is that they're not in touch with their passion. If you're passionate about what it is you do, then you're going to be looking for everything you can to get better at it.","name":"Best Life Quotes"},{"quote":"One today is worth two tomorrows.","name":"Best Life Quotes"},{"quote":"Only as high as I reach can I grow, only as far as I seek can I go, only as deep as I look can I see, only as much as I dream can I be.","name":"Best Life Quotes"},{"quote":"Only those who will risk going too far can possibly find out how far one can go.","name":"Best Life Quotes"},{"quote":"Only you can control your future.","name":"Best Life Quotes"},{"quote":"Our eyes are placed in front because it is more important to look ahead than to look back","name":"Best Life Quotes"},{"quote":"Our lives begin to end the day we become silent about the things that matter.","name":"Best Life Quotes"},{"quote":"Our tears are what happens when it rains deep inside our hearts and we cannot hold the rain any longer.","name":"Best Life Quotes"},{"quote":"Pay no attention to those who talk behind your back. It simply means that you are two steps ahead.!!","name":"Best Life Quotes"},{"quote":"Pay no attention to what people say. Pay very close attention to what they do","name":"Best Life Quotes"},{"quote":"People always say to follow your heart, but what they dont tell you is that if you follow your heart, it doesn’t mean there will be a happy ending.","name":"Best Life Quotes"},{"quote":"People are always going to judge you, but their opinions should never influence how you feel about yourself.","name":"Best Life Quotes"},{"quote":"People are often unreasonable, illogical and self centered. Forgive them anyway.","name":"Best Life Quotes"},{"quote":"People aren't either wicked or noble. They're like chef's salads, with good things and bad things chopped and mixed together in a vinaigrette of confusion and conflict.","name":"Best Life Quotes"},{"quote":"People come in and out of  your life. Only the real ones stay.","name":"Best Life Quotes"},{"quote":"People don’t always need advice. Sometimes all they need is a hand to hold, ear to listen and heart to understand.","name":"Best Life Quotes"},{"quote":"People fear death even more than pain. It's strange that they fear death. Life hurts a lot more than death. At the point of death, the pain is over.","name":"Best Life Quotes"},{"quote":"People never remember the million times you help them, only the one time you don’t.","name":"Best Life Quotes"},{"quote":"People often say that motivation doesn't last. Well, neither does bathing   that's why we recommend it daily.","name":"Best Life Quotes"},{"quote":"People really should remember to engage their brain before they operate their mouth.","name":"Best Life Quotes"},{"quote":"People that are meant to be together always find each other in the end.","name":"Best Life Quotes"},{"quote":"People who are attracted to you because of your pretty face or nice body won't be by your side forever. But the people who can see how beautiful your heart is will never leave you.","name":"Best Life Quotes"},{"quote":"People who are meant to be together will always find their way back.","name":"Best Life Quotes"},{"quote":"People who make fun of others usually cannot think of a single good thing to say about themselves.","name":"Best Life Quotes"},{"quote":"People will try to destroy you with words, and that's terrible, but believing those words is even worse. Don't let people get to you.","name":"Best Life Quotes"},{"quote":"Perhaps our eyes need to be washed by our tears once in a while, so that we can see Life with a clearer view again.","name":"Best Life Quotes"},{"quote":"Personality is like a haircut, once you have that distinctive style you instantly stand out.","name":"Best Life Quotes"},{"quote":"Physical strength is measured by what we can carry and inner strength by what we can bear.","name":"Best Life Quotes"},{"quote":"Pick up the bits and pieces and don't worry about how you're going to put them all together","name":"Best Life Quotes"},{"quote":"Place a higher priority on discovering what a win looks like for the other person.","name":"Best Life Quotes"},{"quote":"Please tell me you will remember, no matter how much I do wrong, that I had the best of intentions all along.","name":"Best Life Quotes"},{"quote":"Pretend that nothing is wrong at all,. close your eyes before you fall. if you can't see it, it's not there, this is life & it's not fair","name":"Best Life Quotes"},{"quote":"Pretty words are not always true. True words are not always pretty.","name":"Best Life Quotes"},{"quote":"Promises are like babies! Fun to make but hell to deliver.","name":"Best Life Quotes"},{"quote":"Purity or impurity depends on oneself. No one can purify another.","name":"Best Life Quotes"},{"quote":"Relationships are like a Book. It takes years to write but second to burn.","name":"Best Life Quotes"},{"quote":"Remember - a statue has never been set up in honor of a critic.","name":"Best Life Quotes"},{"quote":"Remember At The End Of Each Day, It's Just Between You And God","name":"Best Life Quotes"},{"quote":"Remember the past, but don’t live in it.","name":"Best Life Quotes"},{"quote":"Remember we used to talk everyday.. look at us now.!!","name":"Best Life Quotes"},{"quote":"Remember, every flower that ever bloomed had to go through a whole lot of dirt to get there.","name":"Best Life Quotes"},{"quote":"Remember, people will judge you by your actions, not your intentions. You may have a heart of gold but so does a hard-boiled egg.","name":"Best Life Quotes"},{"quote":"Remember, when life knocks you to your knees, you're in the perfect position to pray","name":"Best Life Quotes"},{"quote":"Remember: Just because you had a bad day, does not mean you have a bad life!","name":"Best Life Quotes"},{"quote":"Remember: You are the writer of your own story, other people help you to open the next page.","name":"Best Life Quotes"},{"quote":"Remember… every thing in life is a Choice, and every Choice comes with a Consequence, whether good or bad, Stop and think before you Choose your Consequence!","name":"Best Life Quotes"},{"quote":"Revenge may be sweet, but it makes us bitter. It's better to let go of the pain and move on.","name":"Best Life Quotes"},{"quote":"Running away from your problems is a race you’ll never win.","name":"Best Life Quotes"},{"quote":"SMILE ….. It irritates those who wish to destroy you.","name":"Best Life Quotes"},{"quote":"Sarcasm helps keep you from telling people what you really think of them.","name":"Best Life Quotes"},{"quote":"Saying what you really want and mean, will always save you from relationship misunderstandings…","name":"Best Life Quotes"},{"quote":"Search for a beautiful heart, not a beautiful face. Beautiful things are not always good, but good things are always beautiful.","name":"Best Life Quotes"},{"quote":"Searching for the truth is easy. Accepting the truth is hard.","name":"Best Life Quotes"},{"quote":"Seize the day, embrace the present, enjoy life while you still can.","name":"Best Life Quotes"},{"quote":"Selfishness is better than selflessness. It’s like being happy without giving a DAMN.","name":"Best Life Quotes"},{"quote":"Set your goals high, and don’t stop till you get there.","name":"Best Life Quotes"},{"quote":"She couldn't see the light at the end of the tunnel, only because she closed her eyes","name":"Best Life Quotes"},{"quote":"She hates me….but…. she can’t hate me up to that limit beyond which I love her.","name":"Best Life Quotes"},{"quote":"Short words are best and the old words when short are best of all.","name":"Best Life Quotes"},{"quote":"Sick of crying tired of trying yeah I am smiling, but inside I am DYING","name":"Best Life Quotes"},{"quote":"Slow down. Calm down. Don't worry. Don't hurry. Trust the process.","name":"Best Life Quotes"},{"quote":"Smile. It irritates those who wish to destroy you..","name":"Best Life Quotes"},{"quote":"Smile...It's the key that fits the lock of everybody's heart.","name":"Best Life Quotes"},{"quote":"So tired of people becoming something they said they'd never be","name":"Best Life Quotes"},{"quote":"Society doesn't decide who you are, you do.","name":"Best Life Quotes"},{"quote":"Some Will Practice What They Preach...But Fewer Will Preach What They Practice.","name":"Best Life Quotes"},{"quote":"Some days you don't need words of wisdom or inspiration. Some days you just know you have to do what you have to do.","name":"Best Life Quotes"},{"quote":"Some days you're the windshield, some days you're the bug","name":"Best Life Quotes"},{"quote":"Some people are actually so lucky, be grateful for what you've got  ... it can all be taken away in a second.","name":"Best Life Quotes"},{"quote":"Some people are like clouds. When they disappear, it's a brighter day","name":"Best Life Quotes"},{"quote":"Some people will never appreciate what you do for them.","name":"Best Life Quotes"},{"quote":"Some relations are like TOM & JERRY. They tease eachother but can’t live without eachother.","name":"Best Life Quotes"},{"quote":"Some things in life you have to accept because you have no control over it. Other things you can change because you have the control. You just have to figure out what’s worth fighting for.","name":"Best Life Quotes"},{"quote":"Someday I'll understand this problem, someday this will make sense, someday I will know what to do, someday I will solve this. But in the same day, I'll have another problem.","name":"Best Life Quotes"},{"quote":"Someday, someone will walk into your life and make you realize why it never worked out with anyone else.","name":"Best Life Quotes"},{"quote":"Someone’s opinion of you does not have to become your reality. Surround yourself with people who make you a better person.","name":"Best Life Quotes"},{"quote":"Sometimes I wish I could read your mind to find out how you feel about me.","name":"Best Life Quotes"},{"quote":"Sometimes all you can do is not think, not wonder, not imagine, not obsess. Just breathe, and have faith that everything will work out for the best.","name":"Best Life Quotes"},{"quote":"Sometimes in our life we play with time but when we finally realize that we want to get serious… time starts playing with our life….","name":"Best Life Quotes"},{"quote":"Sometimes its easier to say that you dont care than to explain all the reasons why you still do.","name":"Best Life Quotes"},{"quote":"Sometimes its not the person you miss, but the feelings and moments you has when you were with them.","name":"Best Life Quotes"},{"quote":"Sometimes life hits you in the head with a brick. Don't lose faith.","name":"Best Life Quotes"},{"quote":"Sometimes life is too hard to be alone and sometimes its too good to be alone.","name":"Best Life Quotes"},{"quote":"Sometimes no matter how much you try to speak your heart out, words aren’t just enough to describe how you truly feel.","name":"Best Life Quotes"},{"quote":"Sometimes people try to expose what’s wrong with you because they can’t handle everything that’s right about you.","name":"Best Life Quotes"},{"quote":"Sometimes second chance work out better than the first b’coz you already learned from your mistakes.","name":"Best Life Quotes"},{"quote":"Sometimes the easiest things to hold on are hardest to let go.","name":"Best Life Quotes"},{"quote":"Sometimes we forgive people simply because we want them to remain in our lives. Even when we should actually just let go.","name":"Best Life Quotes"},{"quote":"Sometimes we waste too much time to think about someone that does not think about us for 1 second.","name":"Best Life Quotes"},{"quote":"Sometimes you have to do what’s best for you and your life, not what’s best for everyone else.","name":"Best Life Quotes"},{"quote":"Sometimes you have to forgive & forget. Forgive them for hurting and forget they even exist.","name":"Best Life Quotes"},{"quote":"Sometimes you have to know when to stop hoping.","name":"Best Life Quotes"},{"quote":"Sometimes you keep your feelings to yourself because it’s hard for someone else to understand them.","name":"Best Life Quotes"},{"quote":"Sometimes you need to run away to see who will follow you.","name":"Best Life Quotes"},{"quote":"Sometimes you put walls up not to keep people out, but to see who cares enough to break them down.","name":"Best Life Quotes"},{"quote":"Sometimes, the questions are more important than the answers.","name":"Best Life Quotes"},{"quote":"Somewhere there’s someone who dreams of your smile and finds in your presence that life is worthwhile so when you are lonely remember its true somebody somewhere is thinking of you.","name":"Best Life Quotes"},{"quote":"Sooner or later it wont all be about looks anymore, it will be about whats inside, trust, loyalty and honesty and finding true happiness.","name":"Best Life Quotes"},{"quote":"Speak ill of no man, but speak all the good you know of everybody.","name":"Best Life Quotes"},{"quote":"Speak when you're angry, and you'll make the best speech you'll ever regret","name":"Best Life Quotes"},{"quote":"Spend life with who makes you happy, not who you have to impress","name":"Best Life Quotes"},{"quote":"Spend your life with who makes you happy, not with who you have to impress.","name":"Best Life Quotes"},{"quote":"Stay hungry, stay foolish.","name":"Best Life Quotes"},{"quote":"Step with care and great tact, and remember that Life's a Great Balancing Act.","name":"Best Life Quotes"},{"quote":"Stop advertising your relationship on Facebook. Not everyone wants to see you happy.","name":"Best Life Quotes"},{"quote":"Stop doing PERMANENT things with TEMPORARY people!!!","name":"Best Life Quotes"},{"quote":"Stop making reasons, find solutions, enough with the depressions.","name":"Best Life Quotes"},{"quote":"Stop worrying about what might hold you down, and pay attention to why you're standing up.","name":"Best Life Quotes"},{"quote":"Stupid conversations make sense when you are talking to someone special.","name":"Best Life Quotes"},{"quote":"Success is a relative term. It brings so many relatives.","name":"Best Life Quotes"},{"quote":"Success is not about what you have. It is about how you handle what you have.","name":"Best Life Quotes"},{"quote":"Success is the Best Revenge","name":"Best Life Quotes"},{"quote":"Success is the maximum utilisation of the ability that you have.","name":"Best Life Quotes"},{"quote":"Success is the maximum utilization of the ability that you have.","name":"Best Life Quotes"},{"quote":"Success makes life easier. It doesn’t make living easier.","name":"Best Life Quotes"},{"quote":"Success means having the courage, the determination, and the will to become the person you believe you were meant to be.","name":"Best Life Quotes"},{"quote":"Summer is kind of like the ultimate one night stand: Hot as hell, totally thrilling, and gone before you know it","name":"Best Life Quotes"},{"quote":"TRUST TAKES YEARS TO BUILD & ONLY SECONDS TO SHATTER..","name":"Best Life Quotes"},{"quote":"TRUST: it takes years to build up and seconds to destroy.","name":"Best Life Quotes"},{"quote":"Take a chance! All life is a chance. The man who goes furthest is generally the one who is willing to do and dare.","name":"Best Life Quotes"},{"quote":"Take a stand. Hold on tight. This is life and the ride might get a little bumpy.","name":"Best Life Quotes"},{"quote":"Take chances. Chase your dreams. Don't play safe and be boring. Start living!","name":"Best Life Quotes"},{"quote":"Take control of your emotions, before your emotions take control of you.","name":"Best Life Quotes"},{"quote":"Take it from someone who's fallen. It's a long way down.","name":"Best Life Quotes"},{"quote":"Take the first step in faith. You don't have to see the whole staircase, just take the first step.","name":"Best Life Quotes"},{"quote":"Taking revenge is wrong... VERY VERY wrong... But VERY VERY fun...","name":"Best Life Quotes"},{"quote":"Teachers open the door but you must enter by yourself.","name":"Best Life Quotes"},{"quote":"Tears, hopes, fears, dreams, wishes, love, like, hate, fate. Those are many of the things that hold weight.","name":"Best Life Quotes"},{"quote":"That awkward moment when you're talking to somebody for like an hour & u can't remember their name.!!","name":"Best Life Quotes"},{"quote":"That moment when you give someone advice, they don't listen to you, then you sit back and watch everything you predicted happen.!! :|","name":"Best Life Quotes"},{"quote":"That’s cute how you think that affects me. Truly adorable.","name":"Best Life Quotes"},{"quote":"The average woman would rather have beauty than brains, because the average man can see better than he can think.","name":"Best Life Quotes"},{"quote":"The awkward moment when someone likes your picture that you posted 8 months ago.","name":"Best Life Quotes"},{"quote":"The best and most beautiful things in the world cannot be seen or even touched, they must be felt with the heart","name":"Best Life Quotes"},{"quote":"The best and most beautiful things in the world cannot be seen or even touched; they must be felt with the heart. :)","name":"Best Life Quotes"},{"quote":"The best and most beautiful things in the world can’t be seen, nor touched, but are felt in the heart.","name":"Best Life Quotes"},{"quote":"The best executive is the one who has sense enough to pick good men to do what he wants done, and self-restraint to keep from meddling with them while they do it.","name":"Best Life Quotes"},{"quote":"The best feeling in the world is when you KNOW your heart is smiling..","name":"Best Life Quotes"},{"quote":"The best gift you can give to someone is your time. Because you give them somothing you can never get back.","name":"Best Life Quotes"},{"quote":"The best gifts you can give to someone are not things. The best ones to offer are a little time, love, care and respect.","name":"Best Life Quotes"},{"quote":"The best love story is when you fall in love with the most unexpected person at the most unexpected time.","name":"Best Life Quotes"},{"quote":"The best place in the world is in the arms of someone who will not only hald you at your best but will pick you up and hug you tight at your weakest.","name":"Best Life Quotes"},{"quote":"The best revenge is happiness, b’coz nothing drives people more crazy then seeing someone actually having a good life.","name":"Best Life Quotes"},{"quote":"The best revenge of all: being happy; nothing drives people crazier than seeing someone living a good life.","name":"Best Life Quotes"},{"quote":"The best thing about a boolean is even if you are wrong, you are only off by a bit.","name":"Best Life Quotes"},{"quote":"The best thing about a picture is that it never changes even when the people in it do.","name":"Best Life Quotes"},{"quote":"The best thing about being me, I’m a limited edition, there are no other copies!","name":"Best Life Quotes"},{"quote":"The best thing in life is doing what people say you can’t do.","name":"Best Life Quotes"},{"quote":"The best things in life are FREE …. Family, Friends, Smiles, Hugs, Kisses, Love, Sleep, Good Memories.","name":"Best Life Quotes"},{"quote":"The best things in life are free like Love, Respect, Patience and Kindness.","name":"Best Life Quotes"},{"quote":"The best things in life are the people you love, the places you have seen and the memories you have made along the way.","name":"Best Life Quotes"},{"quote":"The best time to do something worthwhile is between yesterday and tomorrow.","name":"Best Life Quotes"},{"quote":"The best way to screw up your life is to listen to others when they tell you how to live it.","name":"Best Life Quotes"},{"quote":"The best way to tell a girl you love her is to sit beside her, hold her, rest her head on your heartbeat, and stay quiet.","name":"Best Life Quotes"},{"quote":"The biggest problem for one person may be the smallest problem for others. It just depends on how they see it.","name":"Best Life Quotes"},{"quote":"The biggest problem in life isn`t the problem itself, but how people act upon it.","name":"Best Life Quotes"},{"quote":"The biggest risks in life, are usually the ones most worthwhile.","name":"Best Life Quotes"},{"quote":"The choices we make, and the chances we take, determine our destiny.","name":"Best Life Quotes"},{"quote":"The day the child realizes that all adults are imperfect, he becomes an adolescent; the day he forgives them, he becomes an adult; the day he forgives himself, he becomes wise","name":"Best Life Quotes"},{"quote":"The day you learn how not to cry is the day you learn to hate.","name":"Best Life Quotes"},{"quote":"The difference between CAN and CANNOT are only three letters. Three letter that determine your life direction.","name":"Best Life Quotes"},{"quote":"The discipline of writing something down is the first step towards making it happen","name":"Best Life Quotes"},{"quote":"The doors of wisdom are never shut.","name":"Best Life Quotes"},{"quote":"The feeling that i hate the most its feeling alone when a hundred people are by your side","name":"Best Life Quotes"},{"quote":"The first mistake in public business is the going into it.","name":"Best Life Quotes"},{"quote":"The first step towards getting somewhere is to decide that you are not going to stay where you are.","name":"Best Life Quotes"},{"quote":"The good life, as I conceive it, is a happy life. I do not mean that if you are good you will be happy; I mean that if you are happy you will be good.","name":"Best Life Quotes"},{"quote":"The greatest competitor in your life is the life itself.","name":"Best Life Quotes"},{"quote":"The greatest danger for most of us is not that our aim is too high and we miss it, but that it is too low and we reach it.","name":"Best Life Quotes"},{"quote":"The happiest of people don't necessarily have the best of everything, they just make the most of everything that comes along their way.","name":"Best Life Quotes"},{"quote":"The hardest choice to make is between what's RIGHT & what's EASY. When you choose EASY, things go WRONG. When you choose what's RIGHT, things get HARD","name":"Best Life Quotes"},{"quote":"The hardest part about moving forward is not looking back.","name":"Best Life Quotes"},{"quote":"The hardest the battle, the sweetest the victory","name":"Best Life Quotes"},{"quote":"The hardest thing in life is to know which bridge to cross and which to burn.","name":"Best Life Quotes"},{"quote":"The hardest thing in life, is letting go of what you thought was real.","name":"Best Life Quotes"},{"quote":"The heart feels what the eyes cannot see and knows what the mind cannot understand.","name":"Best Life Quotes"},{"quote":"The heart isn't a toy. Give it to someone who deserves it not someone who plays with it.","name":"Best Life Quotes"},{"quote":"The heart that cares too much for others is always misunderstood....The person who acts like caring is always understood.","name":"Best Life Quotes"},{"quote":"The highway of life is not meant to be travelled alone. That's why there's a passing lane.","name":"Best Life Quotes"},{"quote":"The important thing is not to stop questioning.","name":"Best Life Quotes"},{"quote":"The less you talk the more people think about your words","name":"Best Life Quotes"},{"quote":"The life of every person is like a diary in which he means to write one story, and writes another.","name":"Best Life Quotes"},{"quote":"The more little you speak and the more often you listen, makes others listen to you all with more care for every little part of what you speak","name":"Best Life Quotes"},{"quote":"The more you get what you want, the more you want what you don't need.","name":"Best Life Quotes"},{"quote":"The more you know who you are, & what you want, the less you let things upset you.","name":"Best Life Quotes"},{"quote":"The most beautiful attire......................SMILE!","name":"Best Life Quotes"},{"quote":"The most beautiful thing in life is to build a bridge of hope on a sea of despair","name":"Best Life Quotes"},{"quote":"The most difficult thing in any negotiation, almost, is making sure that you strip it of the emotion and deal with the facts.","name":"Best Life Quotes"},{"quote":"The most important decisions you make are not the things you do, but the things you decide not to do.","name":"Best Life Quotes"},{"quote":"The most important trip you may take in life is meeting people half way.","name":"Best Life Quotes"},{"quote":"The most precious possession that ever comes to a man in this world is a woman’s heart.","name":"Best Life Quotes"},{"quote":"The most subversive people are those who ask questions.","name":"Best Life Quotes"},{"quote":"The number of lies told by men would decrease significantly if women stopped asking questions!!","name":"Best Life Quotes"},{"quote":"The one who ignores you are the one who notices you. so don't think that they don't notice you","name":"Best Life Quotes"},{"quote":"The only people you should allow in your life are the ones that prove they deserve to be.","name":"Best Life Quotes"},{"quote":"The only thing worse than being hated is being ignored. At least when they hate you they treat you like you exist","name":"Best Life Quotes"},{"quote":"The only truly painful goodbyes are the ones that are never said and never explained.","name":"Best Life Quotes"},{"quote":"The opposite of a correct statement is a false statement. But the opposite of a profound truth may well be another profound truth.","name":"Best Life Quotes"},{"quote":"The past cannot be changed, forgotten, edited or erased. It can only be accepted.","name":"Best Life Quotes"},{"quote":"The people who appear strongest on the outside are the weakest within","name":"Best Life Quotes"},{"quote":"The people who want to be in your life will always find a way, just don't push them away","name":"Best Life Quotes"},{"quote":"The person who can find sorrow behind your smile… words behind your silence and love behind your anger, is the person who can hold you forever.","name":"Best Life Quotes"},{"quote":"The reason why we hide our feelings from them is the fear that the feeling is not mutual","name":"Best Life Quotes"},{"quote":"The right thing and the easy thing are never the same.","name":"Best Life Quotes"},{"quote":"The saddest aspect of life right now is that science gathers knowledge faster than society gathers wisdom.","name":"Best Life Quotes"},{"quote":"The saddest summary of a life contains three descriptions: could have, might have, and should have.","name":"Best Life Quotes"},{"quote":"The second half of a man’s life is made up habits he has acquired during the first half.","name":"Best Life Quotes"},{"quote":"The secret of life is not to do what you like but to like what you do.","name":"Best Life Quotes"},{"quote":"The secret to a rich life is to have more beginnings than endings.","name":"Best Life Quotes"},{"quote":"The secret to being happy is realizing that no matter how bad life is, it can always get worse","name":"Best Life Quotes"},{"quote":"The secret to happiness is not in doing what one likes to do, but in liking what one has to do.","name":"Best Life Quotes"},{"quote":"The single and most dangerous word to be spoken in business is no. The second most dangerous word is yes. It is possible to avoid saying either.","name":"Best Life Quotes"},{"quote":"The sky is not blue, neither is the water...things are seldom what they seem to be, like people.","name":"Best Life Quotes"},{"quote":"The smallest deed is better than the greatest intention.","name":"Best Life Quotes"},{"quote":"The stuff that will make you laugh will make you cry","name":"Best Life Quotes"},{"quote":"The task ahead of us is never as great as the power behind us.","name":"Best Life Quotes"},{"quote":"The things that scare us the most are also what we want the most in life.","name":"Best Life Quotes"},{"quote":"The things you joke around with are the things that you are too afraid to admit.","name":"Best Life Quotes"},{"quote":"The toughest part of letting go is realizing the other person already did","name":"Best Life Quotes"},{"quote":"The true measure of a man is how he treats someone who can do him absolutely no good.","name":"Best Life Quotes"},{"quote":"The true measure of compatibility is not the years spent together… but how good you are for each other.","name":"Best Life Quotes"},{"quote":"The truth about forever is that it is happening right now","name":"Best Life Quotes"},{"quote":"The truth is something that almost nobody wants to hear, but everyone wants to know","name":"Best Life Quotes"},{"quote":"The truth is, unless you let go unless you forgive the situation, unless you realize the situation is over, you cannot move forward.","name":"Best Life Quotes"},{"quote":"The wealth of the three richest people in the world exceeds the combined GDP of the 48 smallest countries.","name":"Best Life Quotes"},{"quote":"The word “HATERS” begins with the word “HA” for a reason.","name":"Best Life Quotes"},{"quote":"The world is a classroom and everyone in it is your teacher; from the smallest baby to the oldest man, we all hold a lesson to teach. Are you paying attention?","name":"Best Life Quotes"},{"quote":"The world means a lot more when people mean the world to each other.","name":"Best Life Quotes"},{"quote":"The worst battle you have to fight is between what you know and what you feel.","name":"Best Life Quotes"},{"quote":"There are 3 things in life you need: Fortitude, Tenacity and Guts. Fortitude to stand, no matter what, Tenacity to stick with it and Guts to deal with whatever is in front of you.","name":"Best Life Quotes"},{"quote":"There are 3 things that should never get broken a toy, a promise and a heart","name":"Best Life Quotes"},{"quote":"There are hundreds of languages … but a smile speaks them all.","name":"Best Life Quotes"},{"quote":"There are many things in life that will catch your eye, but only a few will catch your heart … pursue those.","name":"Best Life Quotes"},{"quote":"There are many things that we would throw away if we were not afraid that others might pick them up","name":"Best Life Quotes"},{"quote":"There are people in life you learn to live with, there are people you know you can't live without, and then there are people you know life wouldn't be the same without.","name":"Best Life Quotes"},{"quote":"There are some people in life that just makes you laugh a little louder, smile a little bigger and live a little bit better.","name":"Best Life Quotes"},{"quote":"There are things that we don't want to happen but have to accept, things we don't want to know but have to learn, and people we can't live without but have to let go.","name":"Best Life Quotes"},{"quote":"There are things we don't want to happen but have to accept, things we don't want to know but have to learn, and people we can't live without, but have to let go.","name":"Best Life Quotes"},{"quote":"There are three things life brings us: tears, smiles and memories. Tears gets wipe away. A smile fades away. But memories last a lifetime.","name":"Best Life Quotes"},{"quote":"There are two great days in a person's life: the day we are born and the day we discover why.","name":"Best Life Quotes"},{"quote":"There are two kinds of evil people in this world, People who do evil stuff and people who see evil stuff being done and don't do anything about it.","name":"Best Life Quotes"},{"quote":"There are two kinds of secrets. Those we keep from others...And those we hide from ourselves.","name":"Best Life Quotes"},{"quote":"There are two things in life that motivate you, the fear of pain and the desire for pleasure.","name":"Best Life Quotes"},{"quote":"There are two things needed in these days; first, for rich men to find out how poor men live, and second, for poor men to know how rich men work.","name":"Best Life Quotes"},{"quote":"There are two ways of looking at life, first is to see it coming and second is to see it going.","name":"Best Life Quotes"},{"quote":"There comes a time when you have to be strong, hold your head up high, and know you did your best! Don’t ever settle for less than what you deserve..","name":"Best Life Quotes"},{"quote":"There is Hell in Hello and Good in Goodbye. That's why you shouldn't be afraid of Goodbye but careful with the Hello","name":"Best Life Quotes"},{"quote":"There is no greatness without passion to be great, whether it's the aspiration of an athlete or an artist, a scientist, a parent, or a businessperson.","name":"Best Life Quotes"},{"quote":"There is so much freedom, power, and restoration on the other side of letting go.","name":"Best Life Quotes"},{"quote":"There will always be people you can't believe you were friends with...","name":"Best Life Quotes"},{"quote":"There's a difference between hearing somebody and listening to them.","name":"Best Life Quotes"},{"quote":"There's no going back. I've made my choices and by making those choices, I chose to move on","name":"Best Life Quotes"},{"quote":"There's no point in waiting around for something that will never happen","name":"Best Life Quotes"},{"quote":"There's no worse feeling than that millisecond you're sure you are going to die after leaning your chair back a little too far.","name":"Best Life Quotes"},{"quote":"There's nothing wrong with dreaming, Just Don't close your eyes to the treasures around you","name":"Best Life Quotes"},{"quote":"They ignore you now but they will need you later, thats life.","name":"Best Life Quotes"},{"quote":"They say nothing lasts forever, We’ll have to prove them wrong.","name":"Best Life Quotes"},{"quote":"Things always have to be worse before they can get better, so appreciate them when they are right","name":"Best Life Quotes"},{"quote":"Things are going to get bad, get worse. But for the believer everything is always going to be alright.","name":"Best Life Quotes"},{"quote":"Things don't happen for no reason, They happen to teach you something.","name":"Best Life Quotes"},{"quote":"Things don't have to change the world to be important.","name":"Best Life Quotes"},{"quote":"Things that come for free are the most expensive in life.","name":"Best Life Quotes"},{"quote":"Things which matter most must never be at the mercy of things which matter least.","name":"Best Life Quotes"},{"quote":"Things will get worse before they get better. But when they do, remember who put you down, and who helped you up.","name":"Best Life Quotes"},{"quote":"Things work out best for those who make the best of how things work out.","name":"Best Life Quotes"},{"quote":"Thinking is not entertainment but an obligation.","name":"Best Life Quotes"},{"quote":"Thinking that you are forgotten is one thing...but knowing you are is another.","name":"Best Life Quotes"},{"quote":"This is a classic negotiation technique. It's a gentle, soft indication of your disapproval and a great way to keep negotiating. Count to 10. By then, the other person usually will start talking and may very well make a higher offer.","name":"Best Life Quotes"},{"quote":"This is my life, I'm going to do whatever I want to make myself happy. I'm tired of pleasing everybody except myself. This is me, get over it","name":"Best Life Quotes"},{"quote":"This is what we get for wanting to grow up so fast","name":"Best Life Quotes"},{"quote":"This world is already messy before you. If you can't make it better, just don't make it worse.","name":"Best Life Quotes"},{"quote":"Those have a short Lent who owe money to be paid at Easter.","name":"Best Life Quotes"},{"quote":"Those who contemplate the beauty of the earth find reserves of strength that will endure as long as life lasts","name":"Best Life Quotes"},{"quote":"Those who contemplate the beauty of the earth find reserves of strength that will endure as long as life lasts.","name":"Best Life Quotes"},{"quote":"Three can keep a secret, if two of them are dead.","name":"Best Life Quotes"},{"quote":"Three things in life that are never certain -DREAMS SUCCESS FORTUNE","name":"Best Life Quotes"},{"quote":"Three things in life that may never be lost -PEACE HOPE HONESTY","name":"Best Life Quotes"},{"quote":"Three things of life that are most valuable. Love, self confidence & friends.","name":"Best Life Quotes"},{"quote":"Throughout life people will make you mad, disrespect you and treat you bad. Let God deal with the things they do, because hate in your heart will consume you too.","name":"Best Life Quotes"},{"quote":"Time is money.","name":"Best Life Quotes"},{"quote":"To accomplish great things, we must not only act, but also dream; not only plan, but also believe.","name":"Best Life Quotes"},{"quote":"To all my family and friends, I just wanted to tell you that I love you, because yesterday is gone, today’s almost over and tomorrow isn’t promised.","name":"Best Life Quotes"},{"quote":"To be sure of hitting the target, shoot first and call whatever you hit the target.","name":"Best Life Quotes"},{"quote":"To gain something you’ve never had, you have to do something you’ve never done.","name":"Best Life Quotes"},{"quote":"To live a creative life, we must lose our fear of being wrong.","name":"Best Life Quotes"},{"quote":"To live is the rarest thing in the world. Most people exist, that is all.","name":"Best Life Quotes"},{"quote":"To think is easy. To act is hard. But the hardest thing in the world is to act in accordance with your thinking.","name":"Best Life Quotes"},{"quote":"Today was good. Today was fun. Tomorrow is another one.","name":"Best Life Quotes"},{"quote":"Too Many Become Prisoners Of Their Own Mind.","name":"Best Life Quotes"},{"quote":"Too many people try to fake their way through life. That's why the real ones shine so brightly. :)","name":"Best Life Quotes"},{"quote":"Treat everybody as the most important person in the world.","name":"Best Life Quotes"},{"quote":"True friendship comes when silence between two people is comfortable","name":"Best Life Quotes"},{"quote":"True friendship is like sound health; the value of it is seldom known until it be lost.","name":"Best Life Quotes"},{"quote":"Trust me, everybody is kind so long as you dont disturb to them.","name":"Best Life Quotes"},{"quote":"Trust takes years to build, seconds to break, and forever to repair.","name":"Best Life Quotes"},{"quote":"Trust takes years to gain it, but in a second it can be gone, forever.","name":"Best Life Quotes"},{"quote":"Truth is the only safe ground to stand on.","name":"Best Life Quotes"},{"quote":"Trying and Doing are two different things. When you try, you hope. When you do, you succeed.","name":"Best Life Quotes"},{"quote":"U may believe that u r responsible for what u do, but not for what u think. The truth is that u r responsible for what u think, because it is only at this level that u can exercise choice. What u do comes from what u think.","name":"Best Life Quotes"},{"quote":"Use everyday as an opportunity to make tomorrow even more better.","name":"Best Life Quotes"},{"quote":"View life as a continuous learning experience.","name":"Best Life Quotes"},{"quote":"Waiting is painful, forgetting is painful. But not knowing which to do is the worst kind of suffering there is.","name":"Best Life Quotes"},{"quote":"Waiting until your parents are in a good mood before asking them for something you want.","name":"Best Life Quotes"},{"quote":"Waking up in truth is much better than living in a lie.","name":"Best Life Quotes"},{"quote":"We all have our own book of life. We're just trying to find someone who can read it and understand it. Or better yet, help us finish writing it.","name":"Best Life Quotes"},{"quote":"We all have problems; the way we solve them is what makes us different","name":"Best Life Quotes"},{"quote":"We all take different paths in life, but no matter where we go, we take a little of each other everywhere.","name":"Best Life Quotes"},{"quote":"We always ignore the ones who adore us, and adore those who ignore us.","name":"Best Life Quotes"},{"quote":"We always overestimate our worries & underestimate our potential.","name":"Best Life Quotes"},{"quote":"We are all Students and we are all Teachers...so what are you learning and more importantly what are you teaching?","name":"Best Life Quotes"},{"quote":"We are very good lawyers for our own mistakes, but very good judges for the mistakes of others.","name":"Best Life Quotes"},{"quote":"We are what we pretend to be, so we must be careful about what we pretend to be","name":"Best Life Quotes"},{"quote":"We could all take a lesson from crayons: some are sharp, some are beautiful, some have weird names, and all are different colors, but they still learn to live in the same box.","name":"Best Life Quotes"},{"quote":"We do not know the value of our moments until they have become a memory","name":"Best Life Quotes"},{"quote":"We expect others to do what we would never expect of ourselves.","name":"Best Life Quotes"},{"quote":"We expect the whole world to give us a break, and yet ironically we'll find- that when others come asking the same of us, we tell them they're out of their mind.","name":"Best Life Quotes"},{"quote":"We fear rejection, want attention, crave affection and dream of perfection.","name":"Best Life Quotes"},{"quote":"We fear rejection, want attention, crave affection, and dream of perfection","name":"Best Life Quotes"},{"quote":"We have all the solutions to the problems that aren't ours","name":"Best Life Quotes"},{"quote":"We have to dare to be ourselves, however frightening or strange that self may prove to be.","name":"Best Life Quotes"},{"quote":"We must either find a way or make one because there is always a way if we are committed","name":"Best Life Quotes"},{"quote":"We never get old, we simply forget how to have fun.","name":"Best Life Quotes"},{"quote":"We never touch someone so lightly that we don't leave a trace.","name":"Best Life Quotes"},{"quote":"We spend most of our time talking about nothing but I just want to let you know that all these nothings mean so much more to me than so many somethings.","name":"Best Life Quotes"},{"quote":"We want what we can't have, we crave those who hurt us and we desire the touch of those who reject us. Human nature.!!","name":"Best Life Quotes"},{"quote":"We're all human, aren't we? Every human life is worth the same, and worth saving.","name":"Best Life Quotes"},{"quote":"Weakness of attitude becomes weakness of character.","name":"Best Life Quotes"},{"quote":"Well done is better than well said.","name":"Best Life Quotes"},{"quote":"What a life! True life is elsewhere. We are not in the world.","name":"Best Life Quotes"},{"quote":"What defines you is who you are when no one is looking.","name":"Best Life Quotes"},{"quote":"What gives anyone the right to judge. Until you've walked a mile in my shoes, and until you are perfect, only then you have the right. But until then, I'll be the judge of myself, thank you.","name":"Best Life Quotes"},{"quote":"What happens when you realize that everything you ever wanted means nothing anymore","name":"Best Life Quotes"},{"quote":"What hurts the most is the feeling of being replaced. It feels like no matter what you did, it wasn't enough. And no matter how hard you try and capture their heart again, nothing ever works.","name":"Best Life Quotes"},{"quote":"What if? is a question that makes everyone go insane.","name":"Best Life Quotes"},{"quote":"What is life? Look around you for a second. Life is what happens to you right now, while you are reading this. That's you. That's life.","name":"Best Life Quotes"},{"quote":"What made you happy once, might not make you happy now.","name":"Best Life Quotes"},{"quote":"What seems like the right thing to do could also be the hardest thing you have ever done in your life.","name":"Best Life Quotes"},{"quote":"What we call the beginning is often the end. And to make an end is to make a beginning. The end is where we start from.","name":"Best Life Quotes"},{"quote":"What you can become depends upon what you can overcome.","name":"Best Life Quotes"},{"quote":"What you see on the outside is usually the opposite of what's on the inside.","name":"Best Life Quotes"},{"quote":"What's worse than being hated? Being ignored. At least when they hate you, they treat you like you exist.","name":"Best Life Quotes"},{"quote":"What`s better? A lie that draws a smile or the truth that draws a tear?","name":"Best Life Quotes"},{"quote":"Whatever you can do or dream you can, begin it. Boldness has genius, magic, and power in it.","name":"Best Life Quotes"},{"quote":"Whatever you do, good or bad, people will always have something negative to say","name":"Best Life Quotes"},{"quote":"When I look back on my life, I see pain, mistakes and heart ache. When I look in the mirror, I see strength, learned lessons and pride in myself.","name":"Best Life Quotes"},{"quote":"When I look back on my life, I see pain, mistakes and heartache. When I look in the mirror, I see strength, learned lessons, and pride in myself.","name":"Best Life Quotes"},{"quote":"When I think of you, I don’t think of tomorrow.","name":"Best Life Quotes"},{"quote":"When I was little, I hated showers. Now I make life decisions in there.!!","name":"Best Life Quotes"},{"quote":"When all doors behind you get shut, it's a sign that you need to stop looking back and start moving forward.","name":"Best Life Quotes"},{"quote":"When in doubt, don't.","name":"Best Life Quotes"},{"quote":"When life changes to be more difficult, you must change yourself to be stronger.","name":"Best Life Quotes"},{"quote":"When life has torn us down to a crying, uncontrollable, emotional wreck, that is when we truly know who we are.","name":"Best Life Quotes"},{"quote":"When men and women are able to respect and accept their differences then love has a chance to blossom.","name":"Best Life Quotes"},{"quote":"When people disappoint you, just look at God. You'll find something you can't find from this world.","name":"Best Life Quotes"},{"quote":"When people have something bad to say about you, its b’coz they don’t have anything good to say about themselves.","name":"Best Life Quotes"},{"quote":"When people underestimate you, don't be down! Stand up and let them know that they're wrong!","name":"Best Life Quotes"},{"quote":"When someone is there for you and understands you, never take them for granted.","name":"Best Life Quotes"},{"quote":"When someone loves you they don’t have to say it; you can tell by the way they treat you.","name":"Best Life Quotes"},{"quote":"When someone you even don't know, hates you. That is when you know you're the best !","name":"Best Life Quotes"},{"quote":"When we are depressed we expect love from others but when we are happy we just forget to give love to the depressed one.","name":"Best Life Quotes"},{"quote":"When we complain, we remain. When we whine, we stay behind. When we praise, we raise.:)","name":"Best Life Quotes"},{"quote":"When we love, it is not necessary to understand what is happening outside, because everything happens inside us instead.","name":"Best Life Quotes"},{"quote":"When you are in bright light. Everyone Will Follow you But when you are in darkness even your own shadow will not follow you.","name":"Best Life Quotes"},{"quote":"When you are up, your friends know who you are. When you are down, you know who your friends are.","name":"Best Life Quotes"},{"quote":"When you judge someone else, It doesn't define who they are, It defines who you are.","name":"Best Life Quotes"},{"quote":"When you learn how to accept instead of expect, you'll have fewer disappointments.!!","name":"Best Life Quotes"},{"quote":"When you lose everything u want, you find the only thing you need...","name":"Best Life Quotes"},{"quote":"When you make a promise, keep it.","name":"Best Life Quotes"},{"quote":"When you pray, God answers in three ways: He says yes and gives what you ask for. He may give you something better. Or he says no, just be patient and I will give you what you have been wanting on for so long.","name":"Best Life Quotes"},{"quote":"When you reach the end of your rope, tie a knot in it and hang on.","name":"Best Life Quotes"},{"quote":"When you take things for granted, those things eventually get taken..","name":"Best Life Quotes"},{"quote":"When you talk, you repeat what you already know; when you listen, you often learn something.","name":"Best Life Quotes"},{"quote":"When you're finished changing, you're finished.","name":"Best Life Quotes"},{"quote":"When you've a reason to walk away, never look back. For it's better to get lost MOVING ON than to get stuck with the WRONG person","name":"Best Life Quotes"},{"quote":"Whenever I hear someone say, 'Life is hard,' I am always tempted to ask, 'Compared to what?'","name":"Best Life Quotes"},{"quote":"Where do you turn when nothing is right and there is nothing left?","name":"Best Life Quotes"},{"quote":"Where ever I go, whatever I do, I carry a little part of you with me right here in the center of me heart.","name":"Best Life Quotes"},{"quote":"Wherever you go, no matter what the weather, always bring your own sunshine.","name":"Best Life Quotes"},{"quote":"While others live their dreams, i survive my nightmares","name":"Best Life Quotes"},{"quote":"While you’re busy looking for the perfect person, you’ll probably miss the imperfect person who could make you perfectly happy..","name":"Best Life Quotes"},{"quote":"Who are you to judge me. I know I'm not perfect and i don't claim to be. But before you start pointing fingers, make sure your own hands are clean.","name":"Best Life Quotes"},{"quote":"Who are you to judge the life i live? I know I am not perfect, and I don't live to be. But before you start pointing your fingers, make sure your hands are clean","name":"Best Life Quotes"},{"quote":"Who says I'm alone???? I am always with me :-)","name":"Best Life Quotes"},{"quote":"Why Don't You Slip Into Something More Comfortable. Like A Coma","name":"Best Life Quotes"},{"quote":"Why am I upset when I think that I'm different from everybody else, but angry when I realize that I'm the same?","name":"Best Life Quotes"},{"quote":"Why do I care about people that don't care about me? I shouldn't.","name":"Best Life Quotes"},{"quote":"Why do we kill people who kill people to show people that killing people is wrong???","name":"Best Life Quotes"},{"quote":"Wish  upon a shooting star, listen to your dreams, and make your imagination run wild.","name":"Best Life Quotes"},{"quote":"Wishes are always granted but you just have to wait for the perfect time.","name":"Best Life Quotes"},{"quote":"Wishing to be friends is quick work, but friendship is a slow ripening fruit.","name":"Best Life Quotes"},{"quote":"Without love, the rich and poor live in the same house.","name":"Best Life Quotes"},{"quote":"Women fall in love in the presence of a man, while men fall in love in the absence of a woman.","name":"Best Life Quotes"},{"quote":"Words are easy, like the wind; Faithful friends are hard to find","name":"Best Life Quotes"},{"quote":"Words don't have the power to hurt you. Unless the person who said them means a lot to you","name":"Best Life Quotes"},{"quote":"Work hard to get what you like, otherwise you'll be forced to like what you get","name":"Best Life Quotes"},{"quote":"Worrying is like a rocking chair: it gives you something to do, but doesn't get you anywhere.","name":"Best Life Quotes"},{"quote":"Write injuries in dust, benefits in marble.","name":"Best Life Quotes"},{"quote":"Write it on your heart that every day is the best day of the year.","name":"Best Life Quotes"},{"quote":"Yes I am single. Youre gonna have to be amazing to change that.","name":"Best Life Quotes"},{"quote":"Yesterday = Experience ~ Today = Experiment ~ Tomorrow = Expectations. Use ur EXperience in your EXperiment to achieve your EXpectations.","name":"Best Life Quotes"},{"quote":"Yesterday ended last night. Today is a brand-new day.","name":"Best Life Quotes"},{"quote":"You Can Ignore Me As Long As You Want But You Can Never Change The Memories I Brought To Your Life…","name":"Best Life Quotes"},{"quote":"You are a mistake I would gladly repeat.","name":"Best Life Quotes"},{"quote":"You are only young once, but you can be immature forever.","name":"Best Life Quotes"},{"quote":"You can chain me, you can torture me, you can even destroy this body, but you will never imprison my mind.","name":"Best Life Quotes"},{"quote":"You can ignore me for as long as you want, but you can never change the memories that I brought in your life.","name":"Best Life Quotes"},{"quote":"You can only be young once, but you can always be immature.","name":"Best Life Quotes"},{"quote":"You can only control so much, in the end the rest is up to fate.","name":"Best Life Quotes"},{"quote":"You can only fake that everything is ok for so long. Then you just hit that point","name":"Best Life Quotes"},{"quote":"You can only fake that everything is ok for so long. Then you just hit that point....","name":"Best Life Quotes"},{"quote":"You can teach math science history philosophy but you can’t teach common sense.","name":"Best Life Quotes"},{"quote":"You can turn off the sun, But I'm still going to shine.","name":"Best Life Quotes"},{"quote":"You can't turn back the clock. But you can wind it up again.","name":"Best Life Quotes"},{"quote":"You can`t face the problem if the problem iz your face.","name":"Best Life Quotes"},{"quote":"You cannot solve a problem with the same mind that created it.","name":"Best Life Quotes"},{"quote":"You cannot travel the path until you have become the path itself.","name":"Best Life Quotes"},{"quote":"You can’t blame someone for walking away if you didn’t do anything to make them stay.","name":"Best Life Quotes"},{"quote":"You define your own life. Don’t let people write your script..","name":"Best Life Quotes"},{"quote":"You do your best thinking right as you're about to fall asleep. It's during those few moments that you're in touch with your dreams, but awake enough to truly listen to them.","name":"Best Life Quotes"},{"quote":"You don't get to choose how you're going to die, or when. You can decide how you're going to live now.","name":"Best Life Quotes"},{"quote":"You don't have to be afraid of what may be going on in life or what lies ahead. God is right here with you and will help you get through any situation.","name":"Best Life Quotes"},{"quote":"You don't really need someone to complete you. You only need someone to accept you completely.","name":"Best Life Quotes"},{"quote":"You don't stop playing because you grow old; you grow old because you stop playing.","name":"Best Life Quotes"},{"quote":"You don't stop playing because you grow old; you grow old because you stop playing. :))","name":"Best Life Quotes"},{"quote":"You drove me away so now I'm on a new road and a new beginning","name":"Best Life Quotes"},{"quote":"You drove me away so now I'm on a new road and a new beginning ..","name":"Best Life Quotes"},{"quote":"You fall down, and you get back up because staying down on the cold floor isn't really an option.","name":"Best Life Quotes"},{"quote":"You got to hurt in order to know, Fall in order to grow, Lose in order to gain because most of life's lessons are learned in pain","name":"Best Life Quotes"},{"quote":"You have power over your mind - not outside events. Realize this, and you will find strength","name":"Best Life Quotes"},{"quote":"You have to know how to accept rejection and reject acceptance.","name":"Best Life Quotes"},{"quote":"You just have to realize...people are going to stay in our hearts, even when they're not in our lives.","name":"Best Life Quotes"},{"quote":"You just want to die, most people are striving to live.","name":"Best Life Quotes"},{"quote":"You know what’s so hard to find, someone you can actually trust.","name":"Best Life Quotes"},{"quote":"You make a living by what you get, but you make a life by what you give","name":"Best Life Quotes"},{"quote":"You may delay, but time will not.","name":"Best Life Quotes"},{"quote":"You may kill the dreamer, but you will never destroy the dream","name":"Best Life Quotes"},{"quote":"You may not end up where you thought you were going....but you will always end up where you were meant to be","name":"Best Life Quotes"},{"quote":"You may not end up where you thought you were going....but you will always end up where you were meant to be.","name":"Best Life Quotes"},{"quote":"You may shoot me with your words, You may cut me with your eyes, You may kill me with your hatefulness, But still, like air, I'll rise","name":"Best Life Quotes"},{"quote":"You meet thousands of people and none of them really touch you. Then you meet one person, and your life is changed forever.","name":"Best Life Quotes"},{"quote":"You might not always end up where you thought you were going to, but you will always end up where you were meant to be.","name":"Best Life Quotes"},{"quote":"You must decide who people that should be around you. It means you decide who you will be.","name":"Best Life Quotes"},{"quote":"You must make a decision that you are going to move on. It won't happen automatically. You will have to rise up and say,  I don't care how hard this is, I don't care how disappointed I am, I'm not going to let this get the best of me. I'm moving on with my life.","name":"Best Life Quotes"},{"quote":"You must never try to make all the money that's in a deal. Let the other fellow make some money too, because if you have a reputation for always making all the money, you won't have many deals.","name":"Best Life Quotes"},{"quote":"You need to have enough courage not only to come to somebody’s life, but also to stay in it.","name":"Best Life Quotes"},{"quote":"You only get one life; don't be afraid to do what you want to do.","name":"Best Life Quotes"},{"quote":"You only live once, but if you do it right, once is enough.","name":"Best Life Quotes"},{"quote":"You think you're not pretty - There's always someone uglier.","name":"Best Life Quotes"},{"quote":"You think you're not pretty, someone is wishing to be as pretty as you.","name":"Best Life Quotes"},{"quote":"You thought you were a nothing, but you're really a something, which makes you an anything.","name":"Best Life Quotes"},{"quote":"You try so hard to believe that everything happens for a reason, yet there is  not one reason in the world that could satisfy you","name":"Best Life Quotes"},{"quote":"You try to see the best in everyone. But unhappy people are some of the hardest people to like. And that's because they don't like themselves much.","name":"Best Life Quotes"},{"quote":"You want a new life, but you take the new one you get every morning for granted.","name":"Best Life Quotes"},{"quote":"You want to go to the mall - Someone is looking for anything they can wear just to stay warm.","name":"Best Life Quotes"},{"quote":"You want to go to the mall, someone is looking for anything to wear just to stay warm.","name":"Best Life Quotes"},{"quote":"You'll never Leave Where You Are Until You Decide Where You'd Rather Be.","name":"Best Life Quotes"},{"quote":"You'll never be able to move on, if you're not willing to let go.","name":"Best Life Quotes"},{"quote":"You'll never know what is waiting for you outside the lines ... If you're too afraid to cross them....","name":"Best Life Quotes"},{"quote":"You'll never leave where you are until you decide where you'd rather be","name":"Best Life Quotes"},{"quote":"You're not afraid of letting go, you're just afraid of accepting the fact that it's gone.!!","name":"Best Life Quotes"},{"quote":"You're not my friend; friends don't look at each other like we do","name":"Best Life Quotes"},{"quote":"Your attitude, not your aptitude, will determine your altitude.","name":"Best Life Quotes"},{"quote":"Your best dreams and worst nightmares can consist of the same people","name":"Best Life Quotes"},{"quote":"Your first instinct is always right. So, always go with your first instinct. Even if it's a bad idea because bad ideas make good stories.","name":"Best Life Quotes"},{"quote":"Your life may be out of control, but it is not beyond your control.","name":"Best Life Quotes"},{"quote":"You’re always loved by me in ways you’ll never see.","name":"Best Life Quotes"},{"quote":"You’re the best thing that I have, I mean I had.","name":"Best Life Quotes"},{"quote":"being a friend consist more of just saying it. You will not always agree with the decisions that your friends make, but as a friend, you should stand by and respect their decisions regardless of how you feel. People do not have to do things your way..and just because someone doesn't do something the way YOU would do it, does not make them a bad person, it just means they are not you!!.","name":"Best Life Quotes"},{"quote":"care about what other people think and you will be a prisoner for life","name":"Best Life Quotes"},{"quote":"don't make promise when you are in joy. Don't reply when you are sad. don't take decision when you are angry","name":"Best Life Quotes"},{"quote":"don't regret what you said, regret what you didn't say when you had the chance","name":"Best Life Quotes"},{"quote":"every new day is a blank page of your book waiting to be written","name":"Best Life Quotes"},{"quote":"if you really want to do something you'll find a way. if you don't you'll find an excuse","name":"Best Life Quotes"},{"quote":"isn't it weird how you can look at pictures and remember the story behind them but look at the picture and don't remember the person in them ?","name":"Best Life Quotes"},{"quote":"just because it hasn't happened yet, doesn't mean it won't","name":"Best Life Quotes"},{"quote":"leave people better than how you found them. It always comes back to you - everything you do","name":"Best Life Quotes"},{"quote":"life is 2 short 2 be nothing but happy somebody sum where was wishing they could stayed just 1 more day with there family live it up like its your last day on this earth because we are none promised!!!!!!","name":"Best Life Quotes"},{"quote":"life is about appreciating what you have, and waiting patiently for what you will get..","name":"Best Life Quotes"},{"quote":"life is like am hour clock glass..Eventually everything hits the bottom and all you have to do is wait out until someone comes along and turn it around.","name":"Best Life Quotes"},{"quote":"lives like a stage, if you stand on the side lines, you never get to fully see the audience","name":"Best Life Quotes"},{"quote":"no matter how hard we try, life will never be perfect.","name":"Best Life Quotes"},{"quote":"people call me weird and think i take it personally. if you really want to upset me you should call me normal","name":"Best Life Quotes"},{"quote":"people only do to you what you allow them to do!!!","name":"Best Life Quotes"},{"quote":"prays for patience and strength each day...patience to not strangle the stupid and strength to resist the urge!!!","name":"Best Life Quotes"},{"quote":"that awkward moment when you want to tell someone to get a life, but you realize you don't have one...","name":"Best Life Quotes"},{"quote":"the hard part is not making a decision, it is living with it.","name":"Best Life Quotes"},{"quote":"the hardest part of letting go is realizing the other person already has","name":"Best Life Quotes"},{"quote":"there are so many people out there who will tell you that you can't what you've got to do is turn around and say watch me.","name":"Best Life Quotes"},{"quote":"we are all perfectly imperfect! But it's our imperfections that make us individuals!","name":"Best Life Quotes"},{"quote":"we kill people that kill people to show people that killing people is wrong","name":"Best Life Quotes"},{"quote":"we kill people that kill people to show people that killing people is wrong.","name":"Best Life Quotes"},{"quote":"we scream our insecurities, and mutter our apologies and that's why this world, will always be so wrong","name":"Best Life Quotes"},{"quote":"we scream our insecurities, and mutter our apologies; and that's why this world, will always be so wrong","name":"Best Life Quotes"},{"quote":"when i do good no one remembers when i do bad no one forgets","name":"Best Life Quotes"},{"quote":"when you ignore someone who ignores you, it upsets them because you're ignoring them ignoring you.","name":"Best Life Quotes"},{"quote":"wonders what way would you choose. The one to the left...with nothing right? Or the one to the right... with nothing left?","name":"Best Life Quotes"},{"quote":"you have the chance to reach your dreams..just bring them into reality","name":"Best Life Quotes"},{"quote":"you will never become old and wise if you weren't young and crazy","name":"Best Life Quotes"},{"quote":"you will never become who you were meant to be if you keep blaming everyone else for who you are","name":"Best Life Quotes"},{"quote":"‎ And at the end of the day I know I did the best I could do","name":"Best Life Quotes"}
  ]
  }

]
